[
    {
        "q": "What represents the resources owned by a business?",
        "o": [
            "Assets",
            "Liabilities",
            "Equity",
            "Revenue"
        ]
    },
    {
        "q": "Which of the following represents obligations owed by a company?",
        "o": [
            "Liabilities",
            "Assets",
            "Equity",
            "Revenue"
        ]
    },
    {
        "q": "Which financial statement shows the company's earnings over a period of time?",
        "o": [
            "Income Statement",
            "Balance Sheet",
            "Cash Flow Statement",
            "Equity Statement"
        ]
    },
    {
        "q": "Which term refers to the process of allocating the cost of a tangible asset over its useful life?",
        "o": [
            "Depreciation",
            "Amortization",
            "Impairment",
            "Depletion"
        ]
    },
    {
        "q": "Which of the following applies to intangible assets like patents?",
        "o": [
            "Amortization",
            "Depreciation",
            "Revaluation",
            "Exhaustion"
        ]
    },
    {
        "q": "What is used to ensure the accounting books are in balance?",
        "o": [
            "Trial Balance",
            "Income Statement",
            "Balance Sheet",
            "Ledger"
        ]
    },
    {
        "q": "Which accounting term refers to adjustments made at the end of an accounting period?",
        "o": [
            "Adjusting Entries",
            "Closing Entries",
            "Opening Balance",
            "Trial Balance"
        ]
    },
    {
        "q": "What is the accounting equation that represents the relationship between assets, liabilities, and equity?",
        "o": [
            "Assets = Liabilities + Equity",
            "Assets = Liabilities - Equity",
            "Liabilities = Assets + Equity",
            "Equity = Assets - Liabilities"
        ]
    },
    {
        "q": "Which of the following is considered an expense for a business?",
        "o": [
            "Cost of Goods Sold",
            "Equity",
            "Revenue",
            "Assets"
        ]
    },
    {
        "q": "What is the term for the systematic process of allocating an intangible asset's cost?",
        "o": [
            "Amortization",
            "Depreciation",
            "Impairment",
            "Capitalization"
        ]
    },
    {
        "q": "Which of the following best defines equity in accounting?",
        "o": [
            "The owner's interest in the business",
            "The total liabilities of the business",
            "The revenue earned by the business",
            "The total assets of the business"
        ]
    },
    {
        "q": "Which of the following is not a form of revenue?",
        "o": [
            "Sales revenue",
            "Interest income",
            "Investment depreciation",
            "Service revenue"
        ]
    },
    {
        "q": "Which statement is correct about liabilities?",
        "o": [
            "Liabilities represent the claims against the company's assets",
            "Liabilities represent the company's equity",
            "Liabilities are not part of the balance sheet",
            "Liabilities are considered a form of revenue"
        ]
    },
    {
        "q": "Which of the following is true about depreciation?",
        "o": [
            "It reduces the value of tangible assets over time",
            "It increases the asset value over time",
            "It applies only to intangible assets",
            "It is recorded as revenue"
        ]
    },
    {
        "q": "Which of the following would be included in the income statement?",
        "o": [
            "Revenue",
            "Liabilities",
            "Equity",
            "Assets"
        ]
    },
    {
        "q": "What is an example of a liability account?",
        "o": [
            "Accounts payable",
            "Cash",
            "Inventory",
            "Revenue"
        ]
    },
    {
        "q": "What term describes the loss in value of a company's long-term assets due to usage or time?",
        "o": [
            "Depreciation",
            "Amortization",
            "Accrued Expense",
            "Capital Gain"
        ]
    },
    {
        "q": "Which type of account is used to record the cost of goods sold?",
        "o": [
            "Expense Account",
            "Revenue Account",
            "Asset Account",
            "Liability Account"
        ]
    },
    {
        "q": "What is the purpose of the trial balance?",
        "o": [
            "To verify the accuracy of ledger entries",
            "To calculate net income",
            "To prepare the income statement",
            "To record journal entries"
        ]
    },
    {
        "q": "Which of the following is true about the adjusting entries in accounting?",
        "o": [
            "They ensure that revenues and expenses are recorded in the period they occur",
            "They only apply to cash transactions",
            "They are used to close temporary accounts",
            "They are only made at the end of the fiscal year"
        ]
    },
    {
        "q": "What represents the decrease in an asset's value due to wear and tear over time?",
        "o": [
            "Depreciation",
            "Amortization",
            "Exhaustion",
            "Accretion"
        ]
    },
    {
        "q": "Which of the following is an example of a current liability?",
        "o": [
            "Accounts payable",
            "Long-term debt",
            "Owner's equity",
            "Property, plant, and equipment"
        ]
    },
    {
        "q": "Which of the following is not typically classified as an asset?",
        "o": [
            "Goodwill",
            "Accounts payable",
            "Cash",
            "Inventory"
        ]
    },
    {
        "q": "Which term refers to the cost allocation of intangible assets over their useful life?",
        "o": [
            "Amortization",
            "Depreciation",
            "Capitalization",
            "Revaluation"
        ]
    },
    {
        "q": "Which of the following is considered a long-term liability?",
        "o": [
            "Mortgage payable",
            "Accounts payable",
            "Salaries payable",
            "Utilities payable"
        ]
    },
    {
        "q": "Which of the following is an example of a non-current asset?",
        "o": [
            "Property, plant, and equipment",
            "Cash",
            "Accounts receivable",
            "Inventory"
        ]
    },
    {
        "q": "Which of the following financial statements shows the financial position of a company at a specific point in time?",
        "o": [
            "Balance Sheet",
            "Income Statement",
            "Cash Flow Statement",
            "Retained Earnings Statement"
        ]
    },
    {
        "q": "What type of account is accumulated depreciation?",
        "o": [
            "Contra asset account",
            "Revenue account",
            "Expense account",
            "Equity account"
        ]
    },
    {
        "q": "Which of the following would be classified as an operating expense?",
        "o": [
            "Rent",
            "Capital expenditures",
            "Loan repayments",
            "Dividends"
        ]
    },
    {
        "q": "What does the accrual basis of accounting recognize?",
        "o": [
            "Revenues and expenses when they are earned or incurred",
            "Revenues when cash is received",
            "Expenses when cash is paid",
            "Only cash transactions"
        ]
    },
    {
        "q": "Which of the following best describes liabilities?",
        "o": [
            "Obligations that a company owes to external parties",
            "The owner’s claim on the business’s assets",
            "The value of resources controlled by a business",
            "A type of revenue earned by a business"
        ]
    },
    {
        "q": "What is the formula for calculating equity?",
        "o": [
            "Assets - Liabilities",
            "Liabilities - Assets",
            "Assets + Liabilities",
            "Revenue - Expenses"
        ]
    },
    {
        "q": "Which of the following is considered an intangible asset?",
        "o": [
            "Patent",
            "Inventory",
            "Accounts receivable",
            "Property"
        ]
    },
    {
        "q": "Which of the following is true about amortization?",
        "o": [
            "It applies to intangible assets",
            "It applies to tangible assets",
            "It increases the value of the asset",
            "It is used only for depreciation"
        ]
    },
    {
        "q": "Which of the following would not be recorded in the trial balance?",
        "o": [
            "Dividends paid",
            "Accounts payable",
            "Accounts receivable",
            "Cash"
        ]
    },
    {
        "q": "Which term refers to a company's obligations that are due within one year?",
        "o": [
            "Current liabilities",
            "Non-current liabilities",
            "Equity",
            "Assets"
        ]
    },
    {
        "q": "Which of the following financial statements shows a company's profitability?",
        "o": [
            "Income Statement",
            "Balance Sheet",
            "Cash Flow Statement",
            "Retained Earnings Statement"
        ]
    },
    {
        "q": "Which of the following is true about the matching principle in accounting?",
        "o": [
            "Expenses are matched with the revenues they help generate",
            "Assets are matched with liabilities",
            "Expenses are recognized only when cash is paid",
            "Revenues are recognized only when cash is received"
        ]
    },
    {
        "q": "Which of the following would appear on the balance sheet?",
        "o": [
            "Assets",
            "Revenues",
            "Expenses",
            "Net income"
        ]
    },
    {
        "q": "Which of the following is true about depreciation in accounting?",
        "o": [
            "It allocates the cost of tangible assets over their useful life",
            "It applies only to intangible assets",
            "It is considered a form of income",
            "It reduces the value of liabilities"
        ]
    },
    {
        "q": "Which of the following is an example of a deferred revenue?",
        "o": [
            "Unearned sales revenue",
            "Accounts receivable",
            "Accounts payable",
            "Capital stock"
        ]
    },
    {
        "q": "What is the purpose of adjusting entries in accounting?",
        "o": [
            "To ensure that revenues and expenses are recognized in the correct period",
            "To prepare financial statements",
            "To calculate the net income",
            "To record cash transactions"
        ]
    },
    {
        "q": "Which of the following accounts represents the equity of a company?",
        "o": [
            "Common Stock",
            "Accounts Payable",
            "Revenue",
            "Expenses"
        ]
    },
    {
        "q": "What is the effect of depreciation on financial statements?",
        "o": [
            "Reduces asset value and increases expense",
            "Increases asset value and decreases expense",
            "Increases revenue and decreases expense",
            "Has no effect on the financial statements"
        ]
    },
    {
        "q": "Which of the following is an example of an expense account?",
        "o": [
            "Rent expense",
            "Accounts payable",
            "Accumulated depreciation",
            "Capital stock"
        ]
    },
    {
        "q": "Which of the following is a characteristic of a trial balance?",
        "o": [
            "It lists all accounts and their balances at a specific point in time",
            "It is used to calculate net income",
            "It records transactions in chronological order",
            "It only includes revenue and expenses accounts"
        ]
    },
    {
        "q": "Which term refers to the process of recording financial transactions in the correct period?",
        "o": [
            "Accrual accounting",
            "Cash accounting",
            "Capitalization",
            "Depreciation"
        ]
    },
    {
        "q": "Which of the following is true about liabilities?",
        "o": [
            "Liabilities are obligations that a business must settle in the future",
            "Liabilities represent the owner's equity in the business",
            "Liabilities are always paid in cash",
            "Liabilities are considered part of the income statement"
        ]
    },
    {
        "q": "Which of the following accounts would not appear on the balance sheet?",
        "o": [
            "Revenue",
            "Cash",
            "Inventory",
            "Accounts receivable"
        ]
    },
    {
        "q": "Which of the following best describes an asset?",
        "o": [
            "A resource that a business owns and expects to bring future economic benefits",
            "A claim against a business’s resources",
            "A business’s obligations to external parties",
            "The profits a business earns from its operations"
        ]
    },
    {
        "q": "Which of the following is considered a current asset?",
        "o": [
            "Cash",
            "Land",
            "Goodwill",
            "Buildings"
        ]
    },
    {
        "q": "What type of account is accounts payable?",
        "o": [
            "Liability",
            "Asset",
            "Revenue",
            "Equity"
        ]
    },
    {
        "q": "Which of the following best describes an expense?",
        "o": [
            "A decrease in economic benefits from the company’s activities",
            "An increase in the company’s equity",
            "The value of goods and services purchased by the company",
            "The amount of liabilities the company must settle"
        ]
    },
    {
        "q": "What does the matching principle in accounting dictate?",
        "o": [
            "Expenses should be matched with the revenues they help generate",
            "Revenues should be recognized when cash is received",
            "Assets should be capitalized over time",
            "Liabilities should be recorded at historical cost"
        ]
    },
    {
        "q": "Which of the following is true about equity?",
        "o": [
            "Equity represents the residual interest in the assets of the company after deducting liabilities",
            "Equity is the same as revenue",
            "Equity is primarily made up of liabilities",
            "Equity is the same as current assets"
        ]
    },
    {
        "q": "Which of the following would be considered a non-operating expense?",
        "o": [
            "Interest expense",
            "Salaries expense",
            "Cost of goods sold",
            "Rent expense"
        ]
    },
    {
        "q": "Which of the following statements is true about depreciation?",
        "o": [
            "It allocates the cost of an asset over its useful life",
            "It increases the value of an asset over time",
            "It applies only to intangible assets",
            "It represents the cash spent to replace an asset"
        ]
    },
    {
        "q": "Which of the following best describes a revenue account?",
        "o": [
            "An account that represents the earnings from a company's core business activities",
            "An account that tracks the cost of producing goods or services",
            "An account that shows a company's obligations to creditors",
            "An account that reflects the increase in assets from external sources"
        ]
    },
    {
        "q": "Which financial statement would show the effect of depreciation on a company's assets?",
        "o": [
            "Balance Sheet",
            "Income Statement",
            "Cash Flow Statement",
            "Retained Earnings Statement"
        ]
    },
    {
        "q": "Which of the following is an example of a non-current asset?",
        "o": [
            "Intangible assets",
            "Inventory",
            "Accounts receivable",
            "Cash"
        ]
    },
    {
        "q": "What is the purpose of an adjusting entry in accounting?",
        "o": [
            "To ensure the financial statements are accurate for the period",
            "To record cash transactions only",
            "To recognize revenue at the time of cash receipt",
            "To close out temporary accounts"
        ]
    },
    {
        "q": "Which of the following is an example of a long-term asset?",
        "o": [
            "Land",
            "Accounts payable",
            "Inventory",
            "Cash"
        ]
    },
    {
        "q": "What is the definition of working capital?",
        "o": [
            "Current assets minus current liabilities",
            "Long-term assets minus liabilities",
            "Net income after taxes",
            "Total assets minus total liabilities"
        ]
    },
    {
        "q": "Which of the following best describes an expense account?",
        "o": [
            "An account used to track the costs incurred by a business to generate revenue",
            "An account used to track the owner's contributions to the business",
            "An account used to track the earnings from selling products or services",
            "An account used to record the payment of liabilities"
        ]
    },
    {
        "q": "What is amortization used for?",
        "o": [
            "To allocate the cost of intangible assets over their useful life",
            "To reduce the carrying amount of tangible assets",
            "To recognize revenue when cash is received",
            "To allocate liabilities over time"
        ]
    },
    {
        "q": "Which of the following would appear in the trial balance?",
        "o": [
            "Accumulated depreciation",
            "Net income",
            "Retained earnings",
            "Dividends paid"
        ]
    },
    {
        "q": "Which of the following is true about liabilities?",
        "o": [
            "Liabilities are obligations the company must settle in the future with resources",
            "Liabilities represent ownership in the business",
            "Liabilities are recorded only when cash is paid",
            "Liabilities are a source of income for the company"
        ]
    },
    {
        "q": "Which of the following is true about the revenue recognition principle?",
        "o": [
            "Revenue should be recognized when earned, regardless of when cash is received",
            "Revenue should be recognized when cash is received",
            "Revenue should be recognized when goods are sold",
            "Revenue should be recognized when liabilities are settled"
        ]
    },
    {
        "q": "Which of the following best defines depreciation?",
        "o": [
            "The allocation of the cost of a tangible asset over its useful life",
            "The increase in the value of a tangible asset over time",
            "The allocation of the cost of an intangible asset over its useful life",
            "The reduction in liabilities due to payments"
        ]
    },
    {
        "q": "Which of the following accounts is classified as a liability?",
        "o": [
            "Accounts payable",
            "Retained earnings",
            "Common stock",
            "Cash"
        ]
    },
    {
        "q": "Which of the following best describes a current liability?",
        "o": [
            "A liability that is expected to be settled within one year",
            "A liability that is due after one year",
            "A liability that represents long-term obligations",
            "A liability that is not recorded on the balance sheet"
        ]
    },
    {
        "q": "What is the main purpose of depreciation in accounting?",
        "o": [
            "To allocate the cost of an asset over its useful life",
            "To reduce the asset’s book value to zero",
            "To record cash outflows for purchasing assets",
            "To calculate the total tax liabilities"
        ]
    },
    {
        "q": "Which of the following would be classified as an operating expense?",
        "o": [
            "Rent expense",
            "Capital expenditures",
            "Dividends paid",
            "Long-term debt"
        ]
    },
    {
        "q": "Which of the following is an example of an intangible asset?",
        "o": [
            "Goodwill",
            "Inventory",
            "Accounts receivable",
            "Building"
        ]
    },
    {
        "q": "What is the main purpose of a trial balance?",
        "o": [
            "To verify that total debits equal total credits",
            "To summarize a company's revenues and expenses",
            "To calculate the net income of a business",
            "To report changes in equity"
        ]
    },
    {
        "q": "Which of the following is true regarding the revenue recognition principle?",
        "o": [
            "Revenue should be recognized when earned, regardless of when payment is received",
            "Revenue should only be recognized when cash is received",
            "Revenue should be recognized when the goods are sold but not paid for",
            "Revenue should be recognized at the time of purchase"
        ]
    },
    {
        "q": "Which of the following is an example of a non-operating revenue?",
        "o": [
            "Interest income",
            "Sales revenue",
            "Service revenue",
            "Revenue from product sales"
        ]
    },
    {
        "q": "Which of the following is classified as a non-current liability?",
        "o": [
            "Long-term debt",
            "Accounts payable",
            "Accrued expenses",
            "Wages payable"
        ]
    },
    {
        "q": "Which of the following best describes a capital lease?",
        "o": [
            "A lease agreement that transfers ownership of the asset to the lessee",
            "A lease that is treated as an operating expense",
            "A lease that does not affect the lessee’s balance sheet",
            "A lease that does not require payment until after five years"
        ]
    },
    {
        "q": "What is the accounting treatment for depreciation on equipment?",
        "o": [
            "Debit depreciation expense and credit accumulated depreciation",
            "Debit equipment and credit depreciation expense",
            "Debit cash and credit depreciation expense",
            "Debit accumulated depreciation and credit equipment"
        ]
    },
    {
        "q": "What is the purpose of the accrual basis of accounting?",
        "o": [
            "To recognize revenue when earned and expenses when incurred, regardless of cash flow",
            "To record only cash transactions",
            "To recognize revenue only when cash is received",
            "To recognize expenses only when cash is paid"
        ]
    },
    {
        "q": "Which of the following is classified as a non-operating expense?",
        "o": [
            "Interest expense",
            "Cost of goods sold",
            "Salaries expense",
            "Rent expense"
        ]
    },
    {
        "q": "What type of account is common stock in accounting?",
        "o": [
            "Equity",
            "Liability",
            "Asset",
            "Revenue"
        ]
    },
    {
        "q": "Which of the following is an example of a current asset?",
        "o": [
            "Accounts receivable",
            "Goodwill",
            "Machinery",
            "Land"
        ]
    },
    {
        "q": "Which of the following is true about a permanent account?",
        "o": [
            "It carries its balance over to the next accounting period",
            "It is closed at the end of the period",
            "It includes temporary accounts like revenue and expenses",
            "It only records cash transactions"
        ]
    },
    {
        "q": "What is the purpose of the matching principle in accounting?",
        "o": [
            "To match expenses with the revenues they generate in the same period",
            "To ensure that all expenses are paid in cash",
            "To match liabilities with assets",
            "To recognize revenue when it is collected"
        ]
    },
    {
        "q": "Which of the following best defines a liability?",
        "o": [
            "An obligation to pay money or provide services in the future",
            "The owner's interest in the business",
            "A tangible resource owned by the business",
            "A source of revenue for the business"
        ]
    },
    {
        "q": "What is an example of an operating revenue?",
        "o": [
            "Sales of goods or services",
            "Interest income",
            "Dividend income",
            "Gains from asset sales"
        ]
    },
    {
        "q": "Which of the following is true about accumulated depreciation?",
        "o": [
            "It is a contra asset account that reduces the book value of fixed assets",
            "It is a liability account that records future obligations",
            "It increases the value of an asset over time",
            "It is included in the income statement as a non-operating expense"
        ]
    },
    {
        "q": "Which of the following is a key characteristic of a balance sheet?",
        "o": [
            "It shows the company's financial position at a specific point in time",
            "It summarizes the company’s revenues and expenses over a period",
            "It reports cash flow from operating, investing, and financing activities",
            "It shows how much the company owes to creditors"
        ]
    },
    {
        "q": "Which of the following is a characteristic of equity financing?",
        "o": [
            "It involves selling ownership shares in the company",
            "It involves borrowing money that must be repaid",
            "It is a form of long-term liability",
            "It does not require a return on investment"
        ]
    },
    {
        "q": "Which of the following is considered an intangible asset?",
        "o": [
            "Patent",
            "Accounts payable",
            "Inventory",
            "Cash"
        ]
    },
    {
        "q": "Which of the following represents an adjusting entry for accrued revenue?",
        "o": [
            "Debit accounts receivable and credit revenue",
            "Debit revenue and credit cash",
            "Debit accounts payable and credit revenue",
            "Debit cash and credit accounts receivable"
        ]
    },
    {
        "q": "Which of the following is the correct formula for calculating net income?",
        "o": [
            "Revenue - Expenses",
            "Assets - Liabilities",
            "Assets + Liabilities",
            "Sales - Cost of Goods Sold"
        ]
    },
    {
        "q": "What type of account is retained earnings?",
        "o": [
            "Equity",
            "Asset",
            "Liability",
            "Revenue"
        ]
    },
    {
        "q": "Which of the following is an example of a non-cash item in the income statement?",
        "o": [
            "Depreciation expense",
            "Interest paid",
            "Revenue from sales",
            "Cash dividends"
        ]
    },
    {
        "q": "Which of the following would not appear on the balance sheet?",
        "o": [
            "Revenue",
            "Assets",
            "Liabilities",
            "Equity"
        ]
    },
    {
        "q": "What is the primary purpose of the statement of cash flows?",
        "o": [
            "To show how cash is generated and used during a period",
            "To provide information about the company's revenue and expenses",
            "To show the balance of assets and liabilities",
            "To summarize changes in equity"
        ]
    },
    {
        "q": "Which of the following is a characteristic of a capital expenditure?",
        "o": [
            "It is used to acquire or improve long-term assets",
            "It is an expense that is deducted in the period it occurs",
            "It is only related to operating activities",
            "It is recorded as a liability on the balance sheet"
        ]
    },
    {
        "q": "Which of the following is true about an operating lease?",
        "o": [
            "It is treated as an expense and does not affect the balance sheet",
            "It is capitalized on the balance sheet as an asset and liability",
            "It is only used for long-term assets",
            "It involves the purchase of the asset at the end of the lease term"
        ]
    },
    {
        "q": "Which of the following is an example of a fixed cost?",
        "o": [
            "Rent expense",
            "Direct labor costs",
            "Raw material costs",
            "Sales commissions"
        ]
    },
    {
        "q": "Which of the following best describes an operating expense?",
        "o": [
            "Expenses incurred in the normal course of business",
            "Costs of acquiring long-term assets",
            "Expenses related to financing activities",
            "Income from selling assets"
        ]
    },
    {
        "q": "Which of the following is a non-current asset?",
        "o": [
            "Buildings",
            "Cash",
            "Accounts receivable",
            "Inventory"
        ]
    },
    {
        "q": "What is the main purpose of amortization?",
        "o": [
            "To allocate the cost of intangible assets over their useful life",
            "To allocate the cost of tangible assets over their useful life",
            "To record the sale of intangible assets",
            "To track the change in value of stock investments"
        ]
    },
    {
        "q": "Which of the following would be recorded as an increase in assets?",
        "o": [
            "A cash sale",
            "A payment of a liability",
            "A cash dividend",
            "A decrease in stockholders' equity"
        ]
    },
    {
        "q": "Which of the following accounts is typically used in the closing process?",
        "o": [
            "Revenue",
            "Cash",
            "Accounts payable",
            "Capital stock"
        ]
    },
    {
        "q": "Which of the following would cause an increase in liabilities?",
        "o": [
            "Issuing a loan payable",
            "Purchasing inventory on credit",
            "Collecting accounts receivable",
            "Selling goods for cash"
        ]
    },
    {
        "q": "Which of the following is the most likely example of a deferred revenue?",
        "o": [
            "Uncollected rent from tenants",
            "Gift cards sold by a retailer",
            "Accounts payable for raw materials",
            "Interest earned on bonds"
        ]
    },
    {
        "q": "Which of the following best defines working capital?",
        "o": [
            "Current assets minus current liabilities",
            "Total assets minus total liabilities",
            "Net income minus dividends",
            "Revenue minus expenses"
        ]
    },
    {
        "q": "Which of the following is an example of a financing activity in the statement of cash flows?",
        "o": [
            "Issuing common stock",
            "Purchasing equipment",
            "Paying for utilities",
            "Receiving payments from customers"
        ]
    },
    {
        "q": "What is the definition of accrued expenses?",
        "o": [
            "Expenses that have been incurred but not yet paid",
            "Expenses paid in advance",
            "Expenses that are due to be paid next period",
            "Non-operating expenses"
        ]
    },
    {
        "q": "Which of the following is an example of an investment activity in the statement of cash flows?",
        "o": [
            "Buying equipment",
            "Issuing bonds",
            "Paying dividends",
            "Borrowing funds from a bank"
        ]
    },
    {
        "q": "Which of the following is classified as a current liability?",
        "o": [
            "Accounts payable",
            "Long-term debt",
            "Deferred tax liabilities",
            "Preferred stock"
        ]
    },
    {
        "q": "What is the formula to calculate gross profit?",
        "o": [
            "Sales revenue - Cost of goods sold",
            "Revenue - Operating expenses",
            "Net income - Operating expenses",
            "Total assets - Total liabilities"
        ]
    },
    {
        "q": "Which of the following is true about a company's income statement?",
        "o": [
            "It reports a company’s revenues and expenses over a period of time",
            "It shows the company’s financial position at a specific point in time",
            "It lists only the company’s liabilities",
            "It is used to prepare the statement of cash flows"
        ]
    },
    {
        "q": "Which of the following is a characteristic of the FIFO (First In, First Out) inventory method?",
        "o": [
            "The first items purchased are the first ones sold",
            "The most recent items purchased are the first ones sold",
            "It is used when inventory costs are rising",
            "It matches the most recent costs with revenues"
        ]
    },
    {
        "q": "What does the current ratio measure?",
        "o": [
            "A company's ability to pay short-term liabilities with short-term assets",
            "A company’s profitability",
            "The efficiency of a company’s asset utilization",
            "A company’s debt-to-equity ratio"
        ]
    },
    {
        "q": "Which of the following accounts would not appear on the income statement?",
        "o": [
            "Accounts payable",
            "Sales revenue",
            "Interest expense",
            "Cost of goods sold"
        ]
    },
    {
        "q": "Which of the following is considered an operating income?",
        "o": [
            "Revenue from primary business activities",
            "Interest income from investments",
            "Gain on sale of assets",
            "Income from dividend distribution"
        ]
    },
    {
        "q": "Which of the following would be considered a direct cost in manufacturing?",
        "o": [
            "Raw materials used in production",
            "Administrative expenses",
            "Sales commissions",
            "Interest expenses"
        ]
    },
    {
        "q": "Which of the following is an example of an operating lease?",
        "o": [
            "A lease where the lessor retains ownership of the asset",
            "A lease where the lessee will own the asset at the end of the term",
            "A lease with a purchase option at a bargain price",
            "A lease for equipment used in construction"
        ]
    },
    {
        "q": "What is the main purpose of the trial balance?",
        "o": [
            "To verify that debits equal credits",
            "To calculate net income",
            "To report cash flows",
            "To adjust for accruals"
        ]
    },
    {
        "q": "Which of the following accounts is adjusted at the end of the period for accrual accounting?",
        "o": [
            "Accounts payable",
            "Unearned revenue",
            "Cash",
            "Owner's equity"
        ]
    },
    {
        "q": "Which of the following is an example of a contra asset account?",
        "o": [
            "Accumulated depreciation",
            "Accounts payable",
            "Prepaid expenses",
            "Accounts receivable"
        ]
    },
    {
        "q": "Which of the following represents a capital lease?",
        "o": [
            "A lease where the lessee assumes the risks and rewards of ownership",
            "A lease where the lessor retains ownership and the lessee does not have an option to purchase",
            "A short-term lease agreement",
            "A lease for rental equipment"
        ]
    },
    {
        "q": "Which of the following is classified as a non-operating expense?",
        "o": [
            "Interest expense",
            "Cost of goods sold",
            "Sales commissions",
            "Salaries expense"
        ]
    },
    {
        "q": "Which of the following is a primary purpose of the depreciation of fixed assets?",
        "o": [
            "To allocate the cost of an asset over its useful life",
            "To reflect the market value of the asset",
            "To increase the asset's value over time",
            "To account for inflation"
        ]
    },
    {
        "q": "What does amortization apply to?",
        "o": [
            "Intangible assets",
            "Tangible assets",
            "Liabilities",
            "Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a short-term liability?",
        "o": [
            "Accounts payable",
            "Bonds payable",
            "Long-term loans",
            "Stockholders' equity"
        ]
    },
    {
        "q": "Which of the following best describes revenue recognition under accrual accounting?",
        "o": [
            "Revenue is recognized when earned, not necessarily when cash is received",
            "Revenue is recognized only when cash is received",
            "Revenue is recognized at the end of the fiscal year",
            "Revenue is recognized only for cash sales"
        ]
    },
    {
        "q": "Which of the following is considered a current asset?",
        "o": [
            "Accounts receivable",
            "Land",
            "Buildings",
            "Goodwill"
        ]
    },
    {
        "q": "Which of the following is a key characteristic of a liability?",
        "o": [
            "It represents a future obligation to pay or settle",
            "It increases the value of the company",
            "It is always recorded in the equity section of the balance sheet",
            "It represents ownership in the company"
        ]
    },
    {
        "q": "What is the primary function of the statement of cash flows?",
        "o": [
            "To provide information about a company’s cash receipts and cash payments",
            "To show the company’s revenues and expenses",
            "To reflect the changes in stockholders' equity",
            "To calculate net income"
        ]
    },
    {
        "q": "Which of the following is an example of an indirect tax?",
        "o": [
            "Sales tax",
            "Income tax",
            "Property tax",
            "Wealth tax"
        ]
    },
    {
        "q": "Which of the following is true regarding prepaid expenses?",
        "o": [
            "They are considered assets until used or expired",
            "They are immediately expensed in the period incurred",
            "They are classified as liabilities",
            "They reduce a company’s net income immediately"
        ]
    },
    {
        "q": "Which of the following is an example of a deferred tax asset?",
        "o": [
            "Tax payments made in advance",
            "Unpaid income taxes",
            "Long-term debt",
            "Operating expenses"
        ]
    },
    {
        "q": "What is the purpose of adjusting entries?",
        "o": [
            "To ensure that revenues and expenses are recognized in the correct period",
            "To adjust the company’s cash balance",
            "To correct errors in the financial statements",
            "To prepare the income statement"
        ]
    },
    {
        "q": "Which of the following is true about a company's equity?",
        "o": [
            "It represents the ownership interest in the company",
            "It includes all of the company's liabilities",
            "It is calculated by subtracting assets from liabilities",
            "It is equal to the amount of cash a company has"
        ]
    },
    {
        "q": "Which of the following accounts is adjusted for at the end of the accounting period to reflect unearned revenue?",
        "o": [
            "Unearned revenue",
            "Accounts payable",
            "Accounts receivable",
            "Service revenue"
        ]
    },
    {
        "q": "What is the most likely result of underestimating depreciation on a fixed asset?",
        "o": [
            "The company's net income will be higher than it should be",
            "The company will pay less in taxes",
            "The asset’s book value will be higher than its market value",
            "The company will report lower total liabilities"
        ]
    },
    {
        "q": "What is the correct treatment of an impairment loss on an asset?",
        "o": [
            "It reduces the asset's carrying value on the balance sheet",
            "It increases the asset’s value",
            "It is treated as a dividend",
            "It is reported as a liability"
        ]
    },
    {
        "q": "Which of the following is a non-cash transaction?",
        "o": [
            "Issuance of stock in exchange for assets",
            "Payment for goods with cash",
            "Borrowing funds from a bank",
            "Purchasing inventory with cash"
        ]
    },
    {
        "q": "Which financial statement provides a summary of a company’s profitability?",
        "o": [
            "Income statement",
            "Balance sheet",
            "Cash flow statement",
            "Statement of stockholders' equity"
        ]
    },
    {
        "q": "Which of the following best describes a contingent liability?",
        "o": [
            "A potential obligation that depends on the outcome of a future event",
            "An obligation that must be paid within the next 12 months",
            "A liability that is fixed and known",
            "A liability that is due in more than one year"
        ]
    },
    {
        "q": "What does the term ‘liquidity’ refer to in accounting?",
        "o": [
            "The ability to convert assets into cash quickly",
            "The amount of debt a company owes",
            "The amount of money invested in the company",
            "The ratio of current assets to total liabilities"
        ]
    },
    {
        "q": "Which of the following is a characteristic of a bond payable?",
        "o": [
            "It represents a long-term debt that the company must repay",
            "It represents equity ownership in the company",
            "It is a current liability due within one year",
            "It is classified as an asset"
        ]
    },
    {
        "q": "What does the term ‘working capital’ represent?",
        "o": [
            "The difference between current assets and current liabilities",
            "The total amount of long-term debt",
            "The total amount of stockholders' equity",
            "The total amount of net income"
        ]
    },
    {
        "q": "Which of the following is an example of a non-operating income?",
        "o": [
            "Interest income from investments",
            "Revenue from selling products",
            "Sales commissions",
            "Income from services rendered"
        ]
    },
    {
        "q": "What does ‘deferred revenue’ represent?",
        "o": [
            "Revenue received before it is earned",
            "Revenue earned but not yet received",
            "Long-term liabilities",
            "Revenue from investments"
        ]
    },
    {
        "q": "Which of the following is an example of a fixed cost?",
        "o": [
            "Rent expense",
            "Cost of raw materials",
            "Sales commissions",
            "Shipping expenses"
        ]
    },
    {
        "q": "Which of the following is considered a long-term asset?",
        "o": [
            "Property, plant, and equipment",
            "Accounts receivable",
            "Inventory",
            "Cash"
        ]
    },
    {
        "q": "Which of the following is true regarding accrued expenses?",
        "o": [
            "They are recognized as liabilities before the actual cash payment",
            "They are considered prepaid expenses",
            "They are reported as revenue until paid",
            "They reduce net income once paid"
        ]
    },
    {
        "q": "Which of the following is the main purpose of a bank reconciliation?",
        "o": [
            "To ensure the company’s cash records match the bank’s records",
            "To calculate net income",
            "To track the company’s accounts payable",
            "To record revenue and expenses"
        ]
    },
    {
        "q": "Which of the following is a feature of an accrual basis of accounting?",
        "o": [
            "Revenues and expenses are recognized when earned or incurred, regardless of when cash is received or paid",
            "Revenues and expenses are recognized only when cash is received or paid",
            "Expenses are recorded only when the cash payment is made",
            "Revenues are recognized at the end of the fiscal year"
        ]
    },
    {
        "q": "What is a characteristic of the straight-line method of depreciation?",
        "o": [
            "It allocates the same amount of depreciation expense each period over the asset’s useful life",
            "It allocates more depreciation in the earlier periods of the asset’s useful life",
            "It considers the asset’s residual value at the end of its useful life",
            "It is based on the actual usage of the asset"
        ]
    },
    {
        "q": "Which of the following is an example of a fixed asset?",
        "o": [
            "Buildings",
            "Inventory",
            "Accounts receivable",
            "Cash equivalents"
        ]
    },
    {
        "q": "Which of the following is true about goodwill?",
        "o": [
            "Goodwill is an intangible asset that arises from acquiring another company",
            "Goodwill is a liability",
            "Goodwill is classified as a current asset",
            "Goodwill is expensed immediately"
        ]
    },
    {
        "q": "Which of the following best describes ‘amortization’?",
        "o": [
            "The process of allocating the cost of intangible assets over their useful life",
            "The process of allocating the cost of tangible assets over their useful life",
            "The decrease in the value of fixed assets due to use and aging",
            "The process of adjusting the value of investments in securities"
        ]
    },
    {
        "q": "What is the primary purpose of a journal entry?",
        "o": [
            "To record all business transactions in chronological order",
            "To prepare the financial statements",
            "To summarize the company's profits and losses",
            "To track inventory levels"
        ]
    },
    {
        "q": "Which of the following is considered an operating expense?",
        "o": [
            "Salaries expense",
            "Interest expense",
            "Income tax expense",
            "Dividend expense"
        ]
    },
    {
        "q": "Which of the following would be classified as an operating activity in the statement of cash flows?",
        "o": [
            "Cash received from customers",
            "Cash borrowed from a bank",
            "Sale of equipment",
            "Issuance of stock"
        ]
    },
    {
        "q": "What is the accounting treatment for contingent liabilities?",
        "o": [
            "They are disclosed in the notes to the financial statements if the probability is remote",
            "They are recognized only when the future obligation is certain",
            "They are reported as a liability if the chance of loss is more than 50%",
            "They are immediately expensed in the income statement"
        ]
    },
    {
        "q": "What is the purpose of the trial balance?",
        "o": [
            "To ensure that total debits equal total credits",
            "To prepare the balance sheet",
            "To record all cash transactions",
            "To adjust for depreciation"
        ]
    },
    {
        "q": "Which of the following represents a correct matching of a term with its definition?",
        "o": [
            "Revenue: The amount earned from goods or services provided",
            "Assets: The total amount of liabilities",
            "Liabilities: The ownership interest in the company",
            "Equity: The company's debts owed to outsiders"
        ]
    },
    {
        "q": "Which of the following is an example of a deferred expense?",
        "o": [
            "Prepaid insurance",
            "Salaries payable",
            "Income tax payable",
            "Accounts receivable"
        ]
    },
    {
        "q": "Which of the following is an example of an operating lease?",
        "o": [
            "A lease where the lessee doesn’t assume ownership rights",
            "A lease that is classified as a capital lease",
            "A lease where the lessee takes possession of the property",
            "A lease that has a purchase option"
        ]
    },
    {
        "q": "What is the correct accounting treatment for a loss on sale of fixed assets?",
        "o": [
            "The loss is recorded as an expense on the income statement",
            "The loss is added back to the balance sheet",
            "The loss is reported as part of other comprehensive income",
            "The loss is directly adjusted in the equity section"
        ]
    },
    {
        "q": "Which of the following is a key characteristic of a financial liability?",
        "o": [
            "It represents an obligation to transfer economic resources in the future",
            "It increases the company’s equity",
            "It represents ownership interests in the company",
            "It is not reported on the balance sheet"
        ]
    },
    {
        "q": "What is the treatment for unpaid expenses at the end of an accounting period?",
        "o": [
            "They are recorded as accrued liabilities",
            "They are recorded as prepaid expenses",
            "They are recorded as deferred income",
            "They are not recognized until paid"
        ]
    },
    {
        "q": "What is the primary purpose of adjusting entries for prepaid expenses?",
        "o": [
            "To allocate the expense to the correct period",
            "To recognize revenue earned in the period",
            "To adjust the company’s cash balance",
            "To reflect the asset’s fair value"
        ]
    },
    {
        "q": "Which of the following is true about equity financing?",
        "o": [
            "It involves raising capital by issuing shares of stock",
            "It involves borrowing funds that must be repaid with interest",
            "It is less risky than debt financing",
            "It does not affect the ownership structure of the company"
        ]
    },
    {
        "q": "Which of the following is an example of a liability that is due within one year?",
        "o": [
            "Accounts payable",
            "Long-term bonds payable",
            "Goodwill",
            "Property, plant, and equipment"
        ]
    },
    {
        "q": "What is the primary purpose of a cash flow statement?",
        "o": [
            "To provide information about a company’s liquidity and cash flows",
            "To summarize the company’s profits and losses",
            "To show the financial position of a company at a specific date",
            "To report the value of a company’s investments"
        ]
    },
    {
        "q": "What is the main difference between operating and non-operating expenses?",
        "o": [
            "Operating expenses are directly related to core business activities, while non-operating expenses are not",
            "Operating expenses are always fixed, while non-operating expenses are variable",
            "Operating expenses include interest payments, while non-operating expenses do not",
            "Non-operating expenses are included in gross profit, while operating expenses are not"
        ]
    },
    {
        "q": "Which of the following is an example of a non-controlling interest?",
        "o": [
            "Minority interest in a subsidiary",
            "Shareholder's equity in a parent company",
            "Liabilities of the company",
            "Retained earnings of a subsidiary"
        ]
    },
    {
        "q": "What is the accounting treatment for research and development costs under US GAAP?",
        "o": [
            "Research costs are expensed as incurred, while development costs may be capitalized",
            "Both research and development costs are capitalized as assets",
            "Research costs are capitalized, while development costs are expensed",
            "Both research and development costs are expensed as incurred"
        ]
    },
    {
        "q": "Which of the following is true about deferred income taxes?",
        "o": [
            "They arise from differences between the accounting and tax treatment of certain items",
            "They are always recognized as current liabilities",
            "They represent income taxes that have been paid in advance",
            "They are treated as part of the equity section"
        ]
    },
    {
        "q": "What is the primary purpose of adjusting journal entries at the end of the accounting period?",
        "o": [
            "To ensure the financial statements reflect the correct balances for revenues and expenses",
            "To prepare the trial balance",
            "To calculate the company’s cash position",
            "To record transactions not previously entered into the journal"
        ]
    },
    {
        "q": "Which of the following describes a change in accounting estimate?",
        "o": [
            "A revision of an estimate based on new information or experience",
            "A change in accounting policy or principle",
            "The correction of an error in previous financial statements",
            "The change in the basis of consolidation"
        ]
    },
    {
        "q": "What is the purpose of impairment testing for intangible assets?",
        "o": [
            "To determine if the carrying amount exceeds the recoverable amount",
            "To assess the physical condition of the asset",
            "To calculate depreciation expense",
            "To adjust the asset to its market value"
        ]
    },
    {
        "q": "Which of the following would not be classified as a liability?",
        "o": [
            "Owner’s equity",
            "Accounts payable",
            "Notes payable",
            "Accrued expenses"
        ]
    },
    {
        "q": "Which of the following is an example of a capital lease?",
        "o": [
            "A lease where the lessee assumes ownership of the asset at the end of the lease term",
            "A lease with monthly payments only and no option to purchase the asset",
            "A lease that is cancellable by the lessee at any time",
            "A lease where the asset is used for a short-term project"
        ]
    },
    {
        "q": "What is the primary focus of a balance sheet?",
        "o": [
            "To report the financial position of a company at a specific point in time",
            "To summarize the company’s profits and losses over a period of time",
            "To show the cash flows from operating, investing, and financing activities",
            "To list all transactions of a company during a period"
        ]
    },
    {
        "q": "Which of the following is an example of a contingent liability?",
        "o": [
            "A lawsuit where the outcome is uncertain",
            "Accounts payable",
            "Accrued expenses",
            "Deferred taxes"
        ]
    },
    {
        "q": "Which of the following is true about a deferred revenue account?",
        "o": [
            "It represents revenue that has been collected but not yet earned",
            "It represents expenses that have been paid but not yet incurred",
            "It is classified as an asset on the balance sheet",
            "It is only applicable to not-for-profit organizations"
        ]
    },
    {
        "q": "Which of the following is a key feature of the percentage of completion method for revenue recognition?",
        "o": [
            "Revenue is recognized based on the progress of a long-term contract",
            "Revenue is recognized only when the contract is fully completed",
            "Revenue is recognized when cash is received",
            "Revenue is recognized based on the invoiced amount"
        ]
    },
    {
        "q": "Which of the following is the most likely result of an impairment loss?",
        "o": [
            "A reduction in the carrying value of an asset",
            "An increase in the market value of an asset",
            "A reversal of a previous gain",
            "A change in the depreciation method"
        ]
    },
    {
        "q": "What is the purpose of a statement of changes in equity?",
        "o": [
            "To show the changes in a company's equity during a specific period",
            "To report a company’s revenues and expenses",
            "To summarize the company’s cash inflows and outflows",
            "To reconcile the opening and closing balances of assets"
        ]
    },
    {
        "q": "Which of the following is an example of an operating activity in the statement of cash flows?",
        "o": [
            "Cash payments to suppliers for inventory purchases",
            "Proceeds from issuing bonds",
            "Repayment of long-term debt",
            "Proceeds from the sale of fixed assets"
        ]
    },
    {
        "q": "Which of the following is an example of a non-operating expense?",
        "o": [
            "Interest expense",
            "Cost of goods sold",
            "Salaries expense",
            "Rent expense"
        ]
    },
    {
        "q": "Which of the following is a characteristic of a current asset?",
        "o": [
            "It is expected to be converted into cash or used within one year",
            "It represents a long-term investment in the company’s operations",
            "It cannot be sold or transferred",
            "It is not subject to depreciation"
        ]
    },
    {
        "q": "Which of the following would be classified as a financing activity in the statement of cash flows?",
        "o": [
            "Issuance of common stock",
            "Payment to suppliers for inventory",
            "Purchase of equipment",
            "Receipt of interest income"
        ]
    },
    {
        "q": "Which of the following best defines goodwill in accounting?",
        "o": [
            "The excess of the purchase price over the fair value of the identifiable net assets acquired",
            "The total value of a company’s fixed assets",
            "The value of customer relationships",
            "The value of tangible assets"
        ]
    },
    {
        "q": "Which of the following is true about accrued liabilities?",
        "o": [
            "They represent expenses that have been incurred but not yet paid",
            "They are recorded only when cash is paid",
            "They are classified as long-term liabilities",
            "They are not reported on the balance sheet"
        ]
    },
    {
        "q": "What is the purpose of depreciation?",
        "o": [
            "To allocate the cost of a long-term asset over its useful life",
            "To adjust the market value of an asset",
            "To reduce the asset’s market price",
            "To record cash flows related to an asset"
        ]
    },
    {
        "q": "Which of the following is the correct treatment for a revaluation surplus in equity?",
        "o": [
            "It is recorded in the revaluation surplus under equity",
            "It is recorded as an expense in the income statement",
            "It is reported as a liability",
            "It is recorded in retained earnings"
        ]
    },
    {
        "q": "What is the definition of a contingent asset?",
        "o": [
            "An asset that may arise from uncertain future events",
            "An asset that has already been realized",
            "An asset that is guaranteed under a contract",
            "An asset that is always recognized in the financial statements"
        ]
    },
    {
        "q": "Which of the following is the purpose of a trial balance?",
        "o": [
            "To ensure that the total debits equal total credits",
            "To summarize the company’s financial position",
            "To calculate net income",
            "To prepare the statement of cash flows"
        ]
    },
    {
        "q": "Which of the following is true regarding the matching principle in accounting?",
        "o": [
            "Expenses should be recognized in the same period as the related revenues",
            "Revenues should be recognized only when cash is received",
            "Expenses should be recognized before revenues",
            "Revenues should be recognized in the next period"
        ]
    },
    {
        "q": "What is the accounting treatment for a bond issued at a discount?",
        "o": [
            "The bond is recorded at its face value, with a discount recorded as a liability",
            "The bond is recorded at its face value, and the discount is amortized over the life of the bond",
            "The bond is recorded at its market value",
            "The discount is recognized as revenue"
        ]
    },
    {
        "q": "Which of the following is an example of a non-current asset?",
        "o": [
            "Property, plant, and equipment",
            "Accounts receivable",
            "Inventory",
            "Cash and cash equivalents"
        ]
    },
    {
        "q": "Which of the following is true about amortization?",
        "o": [
            "It refers to the process of allocating the cost of intangible assets over time",
            "It applies to tangible assets only",
            "It is used to reduce the liability of a company",
            "It is a one-time charge for an asset"
        ]
    },
    {
        "q": "What does the accounting equation 'Assets = Liabilities + Equity' represent?",
        "o": [
            "The financial position of a company at a specific point in time",
            "The company's income statement for a period",
            "The company's cash flows during a period",
            "The revenue recognition principle"
        ]
    },
    {
        "q": "What is the impact of declaring dividends on a company’s financial statements?",
        "o": [
            "It reduces both cash and retained earnings",
            "It increases liabilities and equity",
            "It increases revenue and liabilities",
            "It has no impact on the financial statements"
        ]
    },
    {
        "q": "Which of the following is a feature of an income statement?",
        "o": [
            "It summarizes a company’s revenues and expenses over a period",
            "It shows the company’s assets and liabilities",
            "It includes all financial transactions of the company",
            "It records changes in the company’s equity"
        ]
    },
    {
        "q": "Which of the following describes a long-term liability?",
        "o": [
            "A liability that is due after more than one year",
            "A liability that must be paid within 30 days",
            "A liability arising from regular operating activities",
            "A liability that is part of equity"
        ]
    },
    {
        "q": "Which of the following is the primary purpose of depreciation?",
        "o": [
            "To allocate the cost of a tangible asset over its useful life",
            "To adjust the market value of an asset to its current value",
            "To calculate the tax payable on an asset",
            "To recognize a loss in the value of a non-tangible asset"
        ]
    },
    {
        "q": "What is the effect of recognizing revenue before it is earned (i.e., premature revenue recognition)?",
        "o": [
            "It can lead to financial statement misrepresentation and compliance issues",
            "It will increase the company’s net income",
            "It will have no effect on the financial statements",
            "It will improve cash flow"
        ]
    },
    {
        "q": "Which of the following is classified as an operating expense?",
        "o": [
            "Rent expense",
            "Loan repayment",
            "Proceeds from issuing stock",
            "Sale of fixed assets"
        ]
    },
    {
        "q": "Which of the following is true about the matching principle in accounting?",
        "o": [
            "It ensures expenses are recorded in the same period as the related revenue",
            "It requires that all expenses be paid before revenue is recognized",
            "It states that only cash-based transactions should be recorded",
            "It recognizes revenue when cash is received, not when it is earned"
        ]
    },
    {
        "q": "Which of the following is considered a current liability?",
        "o": [
            "Accounts payable",
            "Long-term debt",
            "Bonds payable",
            "Deferred tax liabilities"
        ]
    },
    {
        "q": "Which of the following is not a purpose of an income statement?",
        "o": [
            "To determine a company’s profitability over a period of time",
            "To summarize a company’s revenues and expenses",
            "To report the cash flows from operating, investing, and financing activities",
            "To evaluate the performance of the company"
        ]
    },
    {
        "q": "Which of the following is an example of a direct cost?",
        "o": [
            "Cost of raw materials used in production",
            "Administrative salaries",
            "Research and development expenses",
            "Marketing expenses"
        ]
    },
    {
        "q": "Which of the following best defines the term 'liquidity' in accounting?",
        "o": [
            "The ability of a company to meet its short-term obligations",
            "The market value of a company’s assets",
            "The company’s ability to generate revenue",
            "The amount of long-term debt a company carries"
        ]
    },
    {
        "q": "Which of the following is a characteristic of operating income?",
        "o": [
            "It includes revenue and expenses directly related to the core business operations",
            "It includes only interest income",
            "It excludes non-operating income",
            "It represents the company’s net worth"
        ]
    },
    {
        "q": "Which of the following is true about a contra asset account?",
        "o": [
            "It reduces the value of a related asset account",
            "It is an expense account",
            "It increases the asset balance",
            "It is not reported on the balance sheet"
        ]
    },
    {
        "q": "Which of the following is an example of an intangible asset?",
        "o": [
            "Goodwill",
            "Inventory",
            "Buildings",
            "Land"
        ]
    },
    {
        "q": "What is the primary purpose of a statement of cash flows?",
        "o": [
            "To show how changes in balance sheet accounts affect cash",
            "To summarize a company’s revenues and expenses",
            "To determine the financial position of a company",
            "To evaluate a company’s profitability"
        ]
    },
    {
        "q": "Which of the following is true regarding deferred tax liabilities?",
        "o": [
            "They represent taxes owed in the future due to temporary differences",
            "They are taxes that must be paid immediately",
            "They are not reported on the balance sheet",
            "They represent taxes paid in advance"
        ]
    },
    {
        "q": "Which of the following is a characteristic of a capital expenditure?",
        "o": [
            "It is incurred to acquire or improve a long-term asset",
            "It is part of the day-to-day operating costs",
            "It is recorded as an expense on the income statement",
            "It does not affect the balance sheet"
        ]
    },
    {
        "q": "Which of the following best defines the term 'equity' in accounting?",
        "o": [
            "The residual interest in the assets of the entity after deducting liabilities",
            "The total amount owed by the company to creditors",
            "The total assets of the company",
            "The sum of all revenues and expenses"
        ]
    },
    {
        "q": "What is the accounting treatment for an impairment loss on an asset?",
        "o": [
            "It reduces the carrying value of the asset and is recognized as an expense",
            "It increases the value of the asset",
            "It is recorded as an additional liability",
            "It is only recognized if the asset is sold"
        ]
    },
    {
        "q": "Which of the following is an example of a financing activity in the statement of cash flows?",
        "o": [
            "Issuance of bonds payable",
            "Payment to suppliers for inventory",
            "Purchase of machinery",
            "Collection of receivables"
        ]
    },
    {
        "q": "Which of the following best describes a contingent liability?",
        "o": [
            "A potential obligation that depends on the outcome of future events",
            "A liability that is certain to occur in the future",
            "A liability that has already been settled",
            "A liability related to income taxes payable"
        ]
    },
    {
        "q": "Which of the following is a feature of a balance sheet?",
        "o": [
            "It shows the company’s assets, liabilities, and equity at a specific point in time",
            "It summarizes the company’s revenues and expenses over a period",
            "It reports cash inflows and outflows",
            "It calculates net income"
        ]
    },
    {
        "q": "What is the purpose of the matching principle in accounting?",
        "o": [
            "To match expenses with the revenues they help generate in the same period",
            "To match liabilities with assets",
            "To record revenues before they are earned",
            "To match cash flows with operating activities"
        ]
    },
    {
        "q": "Which of the following is an example of an operating activity?",
        "o": [
            "Payment to employees",
            "Issuance of stock",
            "Purchase of equipment",
            "Payment of long-term debt"
        ]
    },
    {
        "q": "What is the effect of a stock split on the balance sheet?",
        "o": [
            "It increases the number of shares outstanding without affecting total equity",
            "It reduces the total equity of the company",
            "It increases the price per share",
            "It has no impact on the balance sheet"
        ]
    },
    {
        "q": "Which of the following best describes the term 'working capital'?",
        "o": [
            "The difference between current assets and current liabilities",
            "The total value of long-term assets",
            "The total liabilities of the company",
            "The amount of cash available for investment"
        ]
    },
    {
        "q": "Which of the following is a characteristic of a revenue recognition principle?",
        "o": [
            "Revenue should be recognized when earned, not when cash is received",
            "Revenue should be recognized only when cash is received",
            "Revenue should be recognized when expenses are incurred",
            "Revenue should be recognized in the next period"
        ]
    },
    {
        "q": "Which of the following best describes the purpose of a trial balance?",
        "o": [
            "To ensure that the total debits equal total credits",
            "To summarize the company’s revenue and expenses",
            "To calculate net income",
            "To prepare the statement of cash flows"
        ]
    },
    {
        "q": "What is the purpose of adjusting entries in accounting?",
        "o": [
            "To update the financial records to reflect accrual accounting",
            "To record cash transactions only",
            "To correct errors in the financial statements",
            "To prepare the trial balance"
        ]
    },
    {
        "q": "Which of the following is true about depreciation and amortization?",
        "o": [
            "Depreciation applies to tangible assets, while amortization applies to intangible assets",
            "Depreciation applies to intangible assets, while amortization applies to tangible assets",
            "Both are applied to intangible assets",
            "Both reduce the value of long-term liabilities"
        ]
    },
    {
        "q": "What is the effect of an error in the trial balance?",
        "o": [
            "It may lead to incorrect financial statements",
            "It does not affect the financial statements",
            "It only affects the income statement",
            "It affects only the cash flow statement"
        ]
    },
    {
        "q": "What is the primary difference between operating and non-operating income?",
        "o": [
            "Operating income is generated from core business activities, while non-operating income comes from secondary sources",
            "Operating income includes all income from external investments",
            "Operating income is not taxable, while non-operating income is",
            "Non-operating income represents the company’s core revenue"
        ]
    },
    {
        "q": "Which of the following is true about accrued expenses?",
        "o": [
            "They are expenses that have been incurred but not yet paid",
            "They are expenses that have been paid but not yet recorded",
            "They are expenses paid in advance",
            "They are considered as liabilities in the balance sheet"
        ]
    },
    {
        "q": "Which of the following represents a liability in the balance sheet?",
        "o": [
            "Accounts payable",
            "Cash",
            "Inventory",
            "Revenue"
        ]
    },
    {
        "q": "What is the effect of recognizing a gain on the sale of an asset in the income statement?",
        "o": [
            "It increases net income",
            "It reduces liabilities",
            "It decreases equity",
            "It increases the asset value"
        ]
    },
    {
        "q": "Which of the following is true regarding the use of the straight-line method of depreciation?",
        "o": [
            "The depreciation expense is the same amount each year",
            "The depreciation expense increases over time",
            "The depreciation expense decreases over time",
            "The depreciation expense is only calculated once at the end of the asset's life"
        ]
    },
    {
        "q": "Which of the following describes a permanent (real) account?",
        "o": [
            "Accounts that carry over their balances to the next accounting period",
            "Accounts that are closed at the end of each accounting period",
            "Accounts that represent the company’s income",
            "Accounts used only for tax reporting"
        ]
    },
    {
        "q": "What is the purpose of an income statement?",
        "o": [
            "To show a company’s revenues and expenses over a period of time",
            "To summarize a company’s assets and liabilities",
            "To list the cash inflows and outflows",
            "To determine a company’s total equity"
        ]
    },
    {
        "q": "Which of the following is an example of a capital lease?",
        "o": [
            "A lease where the lessee assumes the risks and rewards of ownership",
            "A lease that allows the lessor to retain ownership of the asset",
            "A short-term lease with a fixed monthly payment",
            "A lease where the asset is not capitalized on the balance sheet"
        ]
    },
    {
        "q": "Which of the following accounts would appear in the equity section of a balance sheet?",
        "o": [
            "Retained earnings",
            "Accounts payable",
            "Inventory",
            "Cash"
        ]
    },
    {
        "q": "Which of the following best describes the matching principle in accounting?",
        "o": [
            "Expenses should be recognized in the period in which they are incurred to generate revenue",
            "Revenues should be recognized when cash is received",
            "Expenses should only be recorded when they are paid",
            "Revenue should be matched with future period expenses"
        ]
    },
    {
        "q": "What does a company's debt-to-equity ratio measure?",
        "o": [
            "The relative proportion of shareholders' equity and debt used to finance assets",
            "The total amount of long-term debt",
            "The amount of income generated from debt",
            "The ratio of revenue to liabilities"
        ]
    },
    {
        "q": "Which of the following is an example of an operating expense?",
        "o": [
            "Salaries and wages of employees",
            "Purchase of machinery",
            "Long-term loans payable",
            "Issuance of stock"
        ]
    },
    {
        "q": "Which of the following is true about the straight-line depreciation method?",
        "o": [
            "The asset’s value is reduced by the same amount each year",
            "The depreciation expense increases over time",
            "The method results in a higher depreciation in the initial years",
            "The method is used only for tangible assets"
        ]
    },
    {
        "q": "What is the purpose of an adjusting entry in accounting?",
        "o": [
            "To update the financial records to reflect accrued revenues and expenses",
            "To correct errors in the financial statements",
            "To record only cash transactions",
            "To prepare the trial balance"
        ]
    },
    {
        "q": "What does the current ratio measure in financial analysis?",
        "o": [
            "A company’s ability to pay off short-term liabilities with short-term assets",
            "A company’s profitability over a specific period",
            "The relationship between debt and equity",
            "A company’s total revenue compared to its operating costs"
        ]
    },
    {
        "q": "Which of the following is an example of a non-operating expense?",
        "o": [
            "Interest on loans",
            "Cost of goods sold",
            "Wages for employees",
            "Rent expenses"
        ]
    },
    {
        "q": "Which of the following is true about the revenue recognition principle?",
        "o": [
            "Revenue should be recognized when earned, regardless of when cash is received",
            "Revenue should only be recognized when cash is collected",
            "Revenue should be recognized at the end of the fiscal year",
            "Revenue should be recognized when a customer signs a contract"
        ]
    },
    {
        "q": "Which of the following best describes an accrued revenue?",
        "o": [
            "Revenue that has been earned but not yet received or recorded",
            "Revenue that has been received but not yet earned",
            "Revenue that has been both earned and received",
            "Revenue that is expected to be received in the future"
        ]
    },
    {
        "q": "What is the effect of an overstatement of liabilities on the balance sheet?",
        "o": [
            "It reduces equity",
            "It increases equity",
            "It has no impact on the financial statements",
            "It increases assets"
        ]
    },
    {
        "q": "Which of the following best defines 'deferred revenue'?",
        "o": [
            "Money received in advance for goods or services to be delivered in the future",
            "Revenue that is not yet recognized because the work has not been completed",
            "Revenue earned but not yet received",
            "Revenue that is expected to be earned next year"
        ]
    },
    {
        "q": "Which of the following is an example of an intangible asset?",
        "o": [
            "Patent",
            "Inventory",
            "Accounts payable",
            "Machinery"
        ]
    },
    {
        "q": "Which of the following is included in the equity section of the balance sheet?",
        "o": [
            "Common stock",
            "Accounts payable",
            "Retained earnings",
            "Cost of goods sold"
        ]
    },
    {
        "q": "Which of the following would cause a decrease in stockholder's equity?",
        "o": [
            "Net loss for the period",
            "Issuance of stock",
            "Payment of dividends",
            "Increase in assets"
        ]
    },
    {
        "q": "What is the primary purpose of a statement of cash flows?",
        "o": [
            "To provide information about cash inflows and outflows over a period of time",
            "To summarize the company’s financial position",
            "To track changes in stockholder’s equity",
            "To detail the company’s liabilities and assets"
        ]
    },
    {
        "q": "Which of the following would be classified as a long-term liability?",
        "o": [
            "Bonds payable",
            "Accounts payable",
            "Wages payable",
            "Income taxes payable"
        ]
    },
    {
        "q": "What is the primary characteristic of a liability?",
        "o": [
            "It represents an obligation to transfer resources in the future",
            "It represents ownership of assets",
            "It can be converted into cash within one year",
            "It reflects the company's revenues from sales"
        ]
    },
    {
        "q": "Which of the following is an example of a current liability?",
        "o": [
            "Accounts payable",
            "Bonds payable",
            "Long-term loans",
            "Capital stock"
        ]
    },
    {
        "q": "Which of the following is true about equity financing?",
        "o": [
            "It involves selling ownership shares in the company",
            "It requires regular interest payments",
            "It involves borrowing money that must be repaid",
            "It results in increased liabilities"
        ]
    },
    {
        "q": "What is the purpose of depreciation in accounting?",
        "o": [
            "To allocate the cost of a tangible asset over its useful life",
            "To increase the value of an asset over time",
            "To account for the decrease in an asset's market price",
            "To recognize the liability associated with an asset"
        ]
    },
    {
        "q": "Which of the following is an example of an operating activity in the statement of cash flows?",
        "o": [
            "Cash received from customers",
            "Proceeds from the sale of equipment",
            "Issuance of stock",
            "Cash borrowed from a bank"
        ]
    },
    {
        "q": "What is the difference between liabilities and equity?",
        "o": [
            "Liabilities represent obligations, while equity represents ownership",
            "Liabilities are not repayable, while equity is",
            "Liabilities are part of stockholder’s equity",
            "Liabilities are not recorded on the balance sheet"
        ]
    },
    {
        "q": "Which of the following is true about accrual accounting?",
        "o": [
            "Revenues and expenses are recognized when earned or incurred, regardless of cash flow",
            "Revenues are recognized when cash is received",
            "Expenses are recorded only when they are paid",
            "Accrual accounting only applies to businesses with long-term assets"
        ]
    },
    {
        "q": "Which of the following would be classified as a non-current asset?",
        "o": [
            "Land",
            "Accounts receivable",
            "Inventory",
            "Cash"
        ]
    },
    {
        "q": "What does a company's liquidity ratio measure?",
        "o": [
            "The ability to meet short-term obligations with current assets",
            "The company’s overall profitability",
            "The amount of debt in comparison to equity",
            "The efficiency of converting assets into cash"
        ]
    },
    {
        "q": "Which of the following is an example of a financing activity in the statement of cash flows?",
        "o": [
            "Issuance of stock",
            "Purchase of equipment",
            "Payment of operating expenses",
            "Cash received from customers"
        ]
    },
    {
        "q": "What is the accounting treatment for a prepaid expense?",
        "o": [
            "Initially recorded as an asset and expensed over time",
            "Immediately expensed in the period incurred",
            "Recorded as a liability until paid",
            "Recorded as revenue at the time of payment"
        ]
    },
    {
        "q": "Which of the following is true about a trial balance?",
        "o": [
            "It lists all the balances in the general ledger accounts",
            "It is used to prepare the income statement and balance sheet directly",
            "It includes only income and expense accounts",
            "It is required to be submitted to the tax authorities"
        ]
    },
    {
        "q": "Which of the following is an example of an asset?",
        "o": [
            "Cash",
            "Accounts payable",
            "Retained earnings",
            "Revenue"
        ]
    },
    {
        "q": "Which of the following is an example of an indirect method of preparing the statement of cash flows?",
        "o": [
            "Start with net income and adjust for changes in working capital",
            "Start with total cash balance",
            "Directly list cash receipts and payments",
            "List cash inflows and outflows for each operating activity"
        ]
    },
    {
        "q": "What is the definition of amortization?",
        "o": [
            "The allocation of the cost of an intangible asset over its useful life",
            "The increase in the value of an asset over time",
            "The repayment of long-term debt",
            "The decrease in the value of a tangible asset over time"
        ]
    },
    {
        "q": "Which of the following would be included in a company's current assets?",
        "o": [
            "Accounts receivable",
            "Property, plant, and equipment",
            "Intangible assets",
            "Long-term investments"
        ]
    },
    {
        "q": "Which of the following is a characteristic of the straight-line depreciation method?",
        "o": [
            "The same amount of depreciation expense is recognized each period",
            "The depreciation expense increases over time",
            "The depreciation expense decreases over time",
            "Depreciation is based on the asset’s market value"
        ]
    },
    {
        "q": "What is the definition of a liability?",
        "o": [
            "An obligation of the company arising from past transactions that will result in an outflow of resources",
            "An asset that is expected to generate future benefits",
            "An amount of income earned from a sale",
            "The residual interest in the assets of the company after deducting liabilities"
        ]
    },
    {
        "q": "What is the matching principle in accounting?",
        "o": [
            "Expenses should be recorded in the period they help generate revenue",
            "All transactions must be matched to their source",
            "Revenue should be matched to the corresponding expense",
            "Expenses must be recognized at the end of the accounting period"
        ]
    },
    {
        "q": "What is the purpose of an adjusting entry for depreciation?",
        "o": [
            "To record the allocation of the cost of an asset over time",
            "To adjust the value of inventory",
            "To recognize revenue earned but not yet received",
            "To account for prepayments of expenses"
        ]
    },
    {
        "q": "Which of the following accounts will not be included in the trial balance?",
        "o": [
            "Income summary",
            "Retained earnings",
            "Revenue accounts",
            "Accounts payable"
        ]
    },
    {
        "q": "Which of the following is true about current liabilities?",
        "o": [
            "They are obligations the company expects to settle within one year or within its operating cycle",
            "They represent long-term debts the company must repay",
            "They include all forms of equity investments",
            "They are not recorded on the balance sheet"
        ]
    },
    {
        "q": "Which of the following is not a source of equity financing?",
        "o": [
            "Issuing common stock",
            "Issuing bonds",
            "Retaining earnings",
            "Issuing preferred stock"
        ]
    },
    {
        "q": "Which of the following is an example of a non-operating activity?",
        "o": [
            "Gains or losses from the sale of assets",
            "Payment for goods sold",
            "Payment of wages",
            "Cash received from customers"
        ]
    },
    {
        "q": "Which method of depreciation results in the highest expense in the early years of an asset's life?",
        "o": [
            "Declining balance method",
            "Straight-line method",
            "Sum-of-the-years-digits method",
            "Units of production method"
        ]
    },
    {
        "q": "Which of the following accounts would be classified as a liability?",
        "o": [
            "Accounts payable",
            "Retained earnings",
            "Cash",
            "Common stock"
        ]
    },
    {
        "q": "Which of the following best describes an adjusting entry for prepaid expenses?",
        "o": [
            "It reduces the prepaid expense and recognizes the expense over time",
            "It increases prepaid expenses",
            "It recognizes revenue",
            "It reduces the revenue recognized"
        ]
    },
    {
        "q": "Which of the following is true about the revenue recognition principle?",
        "o": [
            "Revenue is recognized when it is earned, regardless of when cash is received",
            "Revenue should only be recognized when the product is sold",
            "Revenue is recognized at the end of the fiscal year",
            "Revenue is recognized when cash is collected"
        ]
    },
    {
        "q": "Which of the following is an example of a cash equivalent?",
        "o": [
            "Money market funds",
            "Accounts receivable",
            "Inventory",
            "Long-term debt"
        ]
    },
    {
        "q": "What is the accounting treatment for a contingent liability?",
        "o": [
            "It is disclosed in the notes to the financial statements if the amount is uncertain",
            "It is immediately recorded as an expense",
            "It is ignored until it is certain",
            "It is recorded as a liability on the balance sheet"
        ]
    },
    {
        "q": "Which of the following would be considered an operating expense?",
        "o": [
            "Rent expense",
            "Interest expense",
            "Income tax expense",
            "Dividends paid"
        ]
    },
    {
        "q": "Which of the following is true about equity financing?",
        "o": [
            "It involves selling ownership shares in the company",
            "It requires repayment with interest",
            "It creates a liability on the balance sheet",
            "It increases the company's liabilities"
        ]
    },
    {
        "q": "What is the main purpose of a trial balance?",
        "o": [
            "To ensure that debits equal credits",
            "To prepare financial statements directly",
            "To summarize income and expenses",
            "To evaluate the company's performance"
        ]
    },
    {
        "q": "Which of the following is an example of a fixed asset?",
        "o": [
            "Land",
            "Accounts payable",
            "Inventory",
            "Accounts receivable"
        ]
    },
    {
        "q": "Which of the following is true about the double-entry system?",
        "o": [
            "Each transaction is recorded in at least two accounts, with a debit and a credit",
            "Each transaction affects only one account",
            "Only revenues and expenses are recorded",
            "It is used only for tax purposes"
        ]
    },
    {
        "q": "Which of the following methods is used to calculate depreciation based on the usage of the asset?",
        "o": [
            "Units of production method",
            "Straight-line method",
            "Declining balance method",
            "Sum-of-the-years-digits method"
        ]
    },
    {
        "q": "Which of the following is considered an intangible asset?",
        "o": [
            "Goodwill",
            "Land",
            "Inventory",
            "Cash"
        ]
    },
    {
        "q": "Which of the following is an example of an accrued liability?",
        "o": [
            "Salaries payable",
            "Accounts payable",
            "Notes payable",
            "Revenue received in advance"
        ]
    },
    {
        "q": "What is the primary purpose of adjusting entries?",
        "o": [
            "To ensure that revenue and expenses are recorded in the correct period",
            "To correct errors in the financial statements",
            "To recognize transactions that were missed",
            "To close temporary accounts"
        ]
    },
    {
        "q": "What is the purpose of a company's retained earnings account?",
        "o": [
            "To show the accumulated profits of the company that have not been distributed as dividends",
            "To account for the company's liabilities",
            "To report the amount of cash held by the company",
            "To track capital expenditures"
        ]
    },
    {
        "q": "Which of the following accounts is typically included in the operating activities section of the statement of cash flows?",
        "o": [
            "Cash received from customers",
            "Proceeds from the issuance of stock",
            "Payment of dividends",
            "Cash paid to acquire new assets"
        ]
    },
    {
        "q": "Which of the following represents a liability?",
        "o": [
            "Accounts payable",
            "Accounts receivable",
            "Owner's equity",
            "Revenue"
        ]
    },
    {
        "q": "Which of the following would be considered an investing activity on the statement of cash flows?",
        "o": [
            "Purchase of equipment",
            "Payment of wages",
            "Cash received from customers",
            "Payment of income taxes"
        ]
    },
    {
        "q": "Which of the following best describes the purpose of a balance sheet?",
        "o": [
            "To provide a snapshot of a company's financial position at a specific point in time",
            "To track a company's income and expenses over a period of time",
            "To summarize the company's cash flow activities",
            "To record daily transactions"
        ]
    },
    {
        "q": "Which of the following is true about the matching principle in accounting?",
        "o": [
            "Expenses should be matched with the revenue they help generate in the same period",
            "Revenue should be recognized when it is received in cash",
            "Expenses should be recognized only when they are paid",
            "Revenue should be recognized at the end of the fiscal year"
        ]
    },
    {
        "q": "Which of the following accounts is part of owner's equity?",
        "o": [
            "Common stock",
            "Accounts payable",
            "Inventory",
            "Prepaid expenses"
        ]
    },
    {
        "q": "Which of the following describes the concept of depreciation?",
        "o": [
            "The allocation of the cost of a tangible asset over its useful life",
            "The increase in the value of a tangible asset over time",
            "The total market value of a tangible asset",
            "The total cost of acquiring a tangible asset"
        ]
    },
    {
        "q": "Which of the following would be considered a non-current asset?",
        "o": [
            "Property, plant, and equipment",
            "Cash",
            "Accounts receivable",
            "Inventory"
        ]
    },
    {
        "q": "What is the purpose of accrued expenses?",
        "o": [
            "To recognize expenses that have been incurred but not yet paid",
            "To recognize expenses that have been paid but not yet incurred",
            "To record the cost of long-term investments",
            "To record the payments to employees"
        ]
    },
    {
        "q": "Which of the following is an example of a revenue recognition principle violation?",
        "o": [
            "Recognizing revenue before the goods are delivered",
            "Recognizing revenue after the product is shipped",
            "Recognizing revenue when the service is performed",
            "Recognizing revenue at the time of payment"
        ]
    },
    {
        "q": "Which of the following is true about the straight-line depreciation method?",
        "o": [
            "The same amount of depreciation is recorded each year",
            "Depreciation expense increases each year",
            "Depreciation expense decreases each year",
            "The method is best for assets with irregular usage patterns"
        ]
    },
    {
        "q": "Which of the following is not a component of liabilities?",
        "o": [
            "Current liabilities",
            "Long-term liabilities",
            "Owner’s equity",
            "Deferred tax liabilities"
        ]
    },
    {
        "q": "Which of the following best defines an operating expense?",
        "o": [
            "Costs incurred in the normal course of business operations",
            "Costs associated with the purchase of long-term assets",
            "Costs related to income generation through investments",
            "Expenses related to financing activities"
        ]
    },
    {
        "q": "Which of the following is not an example of a non-operating expense?",
        "o": [
            "Interest expense",
            "Loss on sale of equipment",
            "Depreciation",
            "Impairment loss"
        ]
    },
    {
        "q": "Which of the following is an example of a cash inflow from financing activities?",
        "o": [
            "Issuing new shares of stock",
            "Selling inventory",
            "Receiving payment for services",
            "Collecting interest on investments"
        ]
    },
    {
        "q": "What does the cost of goods sold (COGS) represent?",
        "o": [
            "The direct costs associated with the production of goods sold by a company",
            "The cost of administrative overheads",
            "The interest paid on loans",
            "The cost of acquiring new equipment"
        ]
    },
    {
        "q": "Which of the following accounts would typically be found in the liabilities section of the balance sheet?",
        "o": [
            "Accounts payable",
            "Retained earnings",
            "Common stock",
            "Cash"
        ]
    },
    {
        "q": "Which of the following is an example of an investing activity on the statement of cash flows?",
        "o": [
            "Purchase of equipment",
            "Payment of wages",
            "Payment of dividends",
            "Selling inventory"
        ]
    },
    {
        "q": "Which of the following is the best definition of amortization?",
        "o": [
            "The allocation of the cost of an intangible asset over its useful life",
            "The process of reducing the value of a tangible asset",
            "The adjustment of accounts based on new information",
            "The recognition of revenue over time"
        ]
    },
    {
        "q": "Which of the following would be considered a current liability?",
        "o": [
            "Accounts payable",
            "Long-term debt",
            "Retained earnings",
            "Stockholders' equity"
        ]
    },
    {
        "q": "What is the formula for calculating working capital?",
        "o": [
            "Current assets - Current liabilities",
            "Total assets - Total liabilities",
            "Net income + Depreciation",
            "Cash flow from operations - Cash flow from investing"
        ]
    },
    {
        "q": "Which of the following is an example of a non-cash transaction?",
        "o": [
            "Issuing stock to purchase assets",
            "Receiving cash from customers",
            "Paying off accounts payable",
            "Collecting cash from a loan"
        ]
    },
    {
        "q": "Which of the following is not a characteristic of an intangible asset?",
        "o": [
            "It has physical substance",
            "It is non-monetary",
            "It is identifiable and separable",
            "It provides long-term value"
        ]
    },
    {
        "q": "Which of the following is true about deferred revenue?",
        "o": [
            "It represents money received for goods or services not yet provided",
            "It is a liability until the service is performed",
            "It is always recognized as revenue immediately",
            "It is considered an expense"
        ]
    },
    {
        "q": "Which of the following would be recorded as an asset on the balance sheet?",
        "o": [
            "Cash",
            "Accounts payable",
            "Notes payable",
            "Owner’s equity"
        ]
    },
    {
        "q": "Which of the following is a direct result of depreciation?",
        "o": [
            "Decrease in asset value",
            "Increase in asset value",
            "Reduction in liabilities",
            "Increase in retained earnings"
        ]
    },
    {
        "q": "Which of the following is true about amortization?",
        "o": [
            "It applies to intangible assets",
            "It applies to tangible assets",
            "It reduces the asset’s useful life",
            "It affects cash flow directly"
        ]
    },
    {
        "q": "Which of the following is an example of a financing activity?",
        "o": [
            "Issuing bonds",
            "Purchasing inventory",
            "Paying for utilities",
            "Selling a building"
        ]
    },
    {
        "q": "Which of the following is included in the owner's equity section of the balance sheet?",
        "o": [
            "Common stock",
            "Accounts payable",
            "Retained earnings",
            "Short-term debt"
        ]
    },
    {
        "q": "Which of the following accounts would be affected by an adjustment for accrued expenses?",
        "o": [
            "Salaries payable",
            "Accounts receivable",
            "Inventory",
            "Prepaid insurance"
        ]
    },
    {
        "q": "Which of the following is considered a capital expenditure?",
        "o": [
            "Purchase of a new machine",
            "Payment of interest on a loan",
            "Repayment of long-term debt",
            "Payment of employee salaries"
        ]
    },
    {
        "q": "Which of the following is considered an asset?", 
        "o": [
            "Cash",
            "Loan Payable",
            "Owner's Equity",
            "Revenue"
        ]
    },
    {
        "q": "What represents the residual interest in the assets of an entity after deducting liabilities?", 
        "o": [
            "Equity",
            "Revenue",
            "Expenses",
            "Liabilities"
        ]
    },
    {
        "q": "Which of the following is a liability?", 
        "o": [
            "Accounts Payable",
            "Inventory",
            "Cash",
            "Equipment"
        ]
    },
    {
        "q": "What is the primary purpose of recognizing revenue?", 
        "o": [
            "To record income earned during a period",
            "To record expenses incurred",
            "To adjust trial balance",
            "To calculate depreciation"
        ]
    },
    {
        "q": "Which of the following is an example of an expense?", 
        "o": [
            "Salaries Paid",
            "Accounts Receivable",
            "Building",
            "Loan"
        ]
    },
    {
        "q": "What is depreciation?", 
        "o": [
            "Allocation of the cost of a tangible asset over its useful life",
            "Recording of revenue",
            "Payment of liabilities",
            "Increase in equity"
        ]
    },
    {
        "q": "Which of the following is true about amortization?", 
        "o": [
            "It applies to intangible assets",
            "It applies to tangible assets",
            "It is the same as depreciation",
            "It increases the asset's value"
        ]
    },
    {
        "q": "What is the purpose of a trial balance?", 
        "o": [
            "To ensure debits equal credits",
            "To record revenue and expenses",
            "To calculate net income",
            "To adjust depreciation"
        ]
    },
    {
        "q": "Which of the following is an example of an adjusting entry?", 
        "o": [
            "Accrued Expenses",
            "Purchase of Equipment",
            "Issuance of Stock",
            "Payment of Dividends"
        ]
    },
    {
        "q": "What is the effect of an adjustment on the trial balance?", 
        "o": [
            "It updates account balances before financial statements are prepared",
            "It records new transactions",
            "It eliminates all liabilities",
            "It increases equity"
        ]
    },
    {
        "q": "Which of the following is a current asset?", 
        "o": [
            "Accounts Receivable",
            "Land",
            "Building",
            "Long-term Investments"
        ]
    },
    {
        "q": "What is the term for obligations that are due within one year?", 
        "o": [
            "Current Liabilities",
            "Long-term Liabilities",
            "Equity",
            "Revenue"
        ]
    },
    {
        "q": "Which of the following is an example of equity?", 
        "o": [
            "Retained Earnings",
            "Accounts Payable",
            "Prepaid Expenses",
            "Accrued Revenue"
        ]
    },
    {
        "q": "What is the primary purpose of recording expenses?", 
        "o": [
            "To match costs with revenues in the period they are incurred",
            "To increase assets",
            "To reduce liabilities",
            "To calculate depreciation"
        ]
    },
    {
        "q": "Which of the following is a non-current asset?", 
        "o": [
            "Machinery",
            "Cash",
            "Inventory",
            "Prepaid Rent"
        ]
    },
    {
        "q": "What is the term for the systematic allocation of the cost of an intangible asset?", 
        "o": [
            "Amortization",
            "Depreciation",
            "Depletion",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a revenue account?", 
        "o": [
            "Sales Revenue",
            "Accounts Payable",
            "Prepaid Expenses",
            "Accrued Expenses"
        ]
    },
    {
        "q": "What is the purpose of adjusting entries in accounting?", 
        "o": [
            "To ensure revenues and expenses are recorded in the correct period",
            "To record new transactions",
            "To close the books at year-end",
            "To calculate equity"
        ]
    },
    {
        "q": "Which of the following is an example of a liability?", 
        "o": [
            "Bonds Payable",
            "Accounts Receivable",
            "Inventory",
            "Prepaid Insurance"
        ]
    },
    {
        "q": "What is the effect of depreciation on an asset's book value?", 
        "o": [
            "It decreases the book value over time",
            "It increases the book value over time",
            "It has no effect on the book value",
            "It eliminates the asset's value"
        ]
    },
    {
        "q": "Which of the following is an example of a long-term liability?", 
        "o": [
            "Mortgage Payable",
            "Accounts Payable",
            "Salaries Payable",
            "Unearned Revenue"
        ]
    },
    {
        "q": "What is the term for the total amount of money earned from sales of goods or services?", 
        "o": [
            "Revenue",
            "Expenses",
            "Equity",
            "Liabilities"
        ]
    },
    {
        "q": "Which of the following is an example of a prepaid expense?", 
        "o": [
            "Prepaid Insurance",
            "Accounts Receivable",
            "Accrued Revenue",
            "Unearned Revenue"
        ]
    },
    {
        "q": "What is the term for the process of recording financial transactions in the accounting system?", 
        "o": [
            "Bookkeeping",
            "Depreciation",
            "Amortization",
            "Trial Balance"
        ]
    },
    {
        "q": "Which of the following is an example of an intangible asset?", 
        "o": [
            "Patent",
            "Inventory",
            "Cash",
            "Building"
        ]
    },
    {
        "q": "What is the term for the total amount of money owed to a company by its customers?", 
        "o": [
            "Accounts Receivable",
            "Accounts Payable",
            "Unearned Revenue",
            "Prepaid Expenses"
        ]
    },
    {
        "q": "Which of the following is an example of an accrued expense?", 
        "o": [
            "Salaries Payable",
            "Prepaid Rent",
            "Unearned Revenue",
            "Accounts Receivable"
        ]
    },
    {
        "q": "What is the term for the process of spreading the cost of a natural resource over its usage period?", 
        "o": [
            "Depletion",
            "Depreciation",
            "Amortization",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a contra-asset account?", 
        "o": [
            "Accumulated Depreciation",
            "Accounts Payable",
            "Revenue",
            "Expenses"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows a company's financial position at a specific point in time?", 
        "o": [
            "Balance Sheet",
            "Income Statement",
            "Cash Flow Statement",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a current liability?", 
        "o": [
            "Short-term Loan",
            "Land",
            "Building",
            "Long-term Investments"
        ]
    },
    {
        "q": "What is the term for the profit earned by a company after deducting all expenses?", 
        "o": [
            "Net Income",
            "Revenue",
            "Gross Profit",
            "Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a non-current liability?", 
        "o": [
            "Bonds Payable",
            "Accounts Payable",
            "Prepaid Expenses",
            "Accrued Revenue"
        ]
    },
    {
        "q": "What is the term for the process of recording revenue when it is earned and expenses when they are incurred, regardless of cash flow?", 
        "o": [
            "Accrual Accounting",
            "Cash Accounting",
            "Depreciation",
            "Amortization"
        ]
    },
    {
        "q": "Which of the following is an example of a contra-liability account?", 
        "o": [
            "Discount on Bonds Payable",
            "Accumulated Depreciation",
            "Accounts Receivable",
            "Prepaid Rent"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows a company's revenues and expenses over a period of time?", 
        "o": [
            "Income Statement",
            "Balance Sheet",
            "Cash Flow Statement",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of an unearned revenue?", 
        "o": [
            "Advance Payment from Customers",
            "Accounts Receivable",
            "Prepaid Insurance",
            "Accrued Expenses"
        ]
    },
    {
        "q": "What is the term for the process of allocating the cost of a natural resource over its useful life?", 
        "o": [
            "Depletion",
            "Depreciation",
            "Amortization",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a temporary account?", 
        "o": [
            "Sales Revenue",
            "Building",
            "Land",
            "Loan Payable"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows changes in equity over a period of time?", 
        "o": [
            "Statement of Equity",
            "Income Statement",
            "Balance Sheet",
            "Cash Flow Statement"
        ]
    },
    {
        "q": "Which of the following is an example of a fixed asset?", 
        "o": [
            "Machinery",
            "Cash",
            "Accounts Receivable",
            "Inventory"
        ]
    },
    {
        "q": "What is the term for the amount of money a company owes to its suppliers for goods or services received?", 
        "o": [
            "Accounts Payable",
            "Accounts Receivable",
            "Unearned Revenue",
            "Prepaid Expenses"
        ]
    },
    {
        "q": "Which of the following is an example of an operating expense?", 
        "o": [
            "Rent Expense",
            "Loan Payable",
            "Building",
            "Land"
        ]
    },
    {
        "q": "What is the term for the process of reducing the value of an asset due to wear and tear?", 
        "o": [
            "Depreciation",
            "Amortization",
            "Depletion",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a financial asset?", 
        "o": [
            "Investments in Stocks",
            "Inventory",
            "Prepaid Rent",
            "Accrued Revenue"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows a company's cash inflows and outflows over a period of time?", 
        "o": [
            "Cash Flow Statement",
            "Income Statement",
            "Balance Sheet",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a permanent account?", 
        "o": [
            "Retained Earnings",
            "Sales Revenue",
            "Rent Expense",
            "Cost of Goods Sold"
        ]
    },
    {
        "q": "What is the term for the process of recording revenue when cash is received and expenses when cash is paid?", 
        "o": [
            "Cash Accounting",
            "Accrual Accounting",
            "Depreciation",
            "Amortization"
        ]
    },
    {
        "q": "Which of the following is an example of a non-operating expense?", 
        "o": [
            "Interest Expense",
            "Salaries Expense",
            "Rent Expense",
            "Cost of Goods Sold"
        ]
    },
    {
        "q": "What is the term for the financial statement that summarizes a company's revenues, expenses, and net income over a period of time?", 
        "o": [
            "Income Statement",
            "Balance Sheet",
            "Cash Flow Statement",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a liquid asset?", 
        "o": [
            "Cash",
            "Land",
            "Building",
            "Patents"
        ]
    },
    {
        "q": "What is the term for the total amount of money a company has earned from its primary business activities?", 
        "o": [
            "Operating Revenue",
            "Non-operating Revenue",
            "Equity",
            "Liabilities"
        ]
    },
    {
        "q": "Which of the following is an example of a deferred revenue?", 
        "o": [
            "Advance Payment for Services",
            "Accounts Receivable",
            "Prepaid Insurance",
            "Accrued Expenses"
        ]
    },
    {
        "q": "What is the term for the process of allocating the cost of an intangible asset over its useful life?", 
        "o": [
            "Amortization",
            "Depreciation",
            "Depletion",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a capital expenditure?", 
        "o": [
            "Purchase of Machinery",
            "Payment of Salaries",
            "Rent Expense",
            "Utilities Expense"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows changes in a company's cash position over a period of time?", 
        "o": [
            "Cash Flow Statement",
            "Income Statement",
            "Balance Sheet",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a non-current asset?", 
        "o": [
            "Goodwill",
            "Cash",
            "Inventory",
            "Prepaid Rent"
        ]
    },
    {
        "q": "What is the term for the process of recording expenses in the period they are incurred, regardless of when cash is paid?", 
        "o": [
            "Accrual Accounting",
            "Cash Accounting",
            "Depreciation",
            "Amortization"
        ]
    },
    {
        "q": "Which of the following is an example of a direct cost?", 
        "o": [
            "Raw Materials",
            "Rent Expense",
            "Utilities Expense",
            "Salaries Expense"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows a company's assets, liabilities, and equity at a specific point in time?", 
        "o": [
            "Balance Sheet",
            "Income Statement",
            "Cash Flow Statement",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a contingent liability?", 
        "o": [
            "Pending Lawsuit",
            "Accounts Payable",
            "Mortgage Payable",
            "Unearned Revenue"
        ]
    },
    {
        "q": "What is the term for the total amount of money a company owes to its creditors?", 
        "o": [
            "Total Liabilities",
            "Total Assets",
            "Equity",
            "Revenue"
        ]
    },
    {
        "q": "Which of the following is an example of an indirect cost?", 
        "o": [
            "Factory Utilities",
            "Raw Materials",
            "Direct Labor",
            "Manufacturing Supplies"
        ]
    },
    {
        "q": "What is the term for the process of writing off the cost of a natural resource as it is consumed?", 
        "o": [
            "Depletion",
            "Depreciation",
            "Amortization",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a revenue expenditure?", 
        "o": [
            "Repair and Maintenance Costs",
            "Purchase of Land",
            "Acquisition of Machinery",
            "Building Construction"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows the changes in retained earnings over a period of time?", 
        "o": [
            "Statement of Retained Earnings",
            "Income Statement",
            "Balance Sheet",
            "Cash Flow Statement"
        ]
    },
    {
        "q": "Which of the following is an example of a tangible asset?", 
        "o": [
            "Equipment",
            "Goodwill",
            "Patent",
            "Trademark"
        ]
    },
    {
        "q": "What is the term for the process of recording revenue when it is earned, regardless of when cash is received?", 
        "o": [
            "Revenue Recognition Principle",
            "Matching Principle",
            "Cost Principle",
            "Conservatism Principle"
        ]
    },
    {
        "q": "Which of the following is an example of a non-operating revenue?", 
        "o": [
            "Interest Income",
            "Sales Revenue",
            "Service Revenue",
            "Rent Revenue"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows the sources and uses of cash in operating, investing, and financing activities?", 
        "o": [
            "Cash Flow Statement",
            "Income Statement",
            "Balance Sheet",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a current asset?", 
        "o": [
            "Inventory",
            "Land",
            "Building",
            "Long-term Investments"
        ]
    },
    {
        "q": "What is the term for the total amount of money invested by shareholders in a company?", 
        "o": [
            "Shareholders' Equity",
            "Revenue",
            "Liabilities",
            "Expenses"
        ]
    },
    {
        "q": "Which of the following is an example of a prepaid liability?", 
        "o": [
            "Unearned Revenue",
            "Accounts Payable",
            "Accrued Expenses",
            "Salaries Payable"
        ]
    },
    {
        "q": "What is the term for the process of allocating the cost of a tangible asset over its useful life?", 
        "o": [
            "Depreciation",
            "Amortization",
            "Depletion",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a financial liability?", 
        "o": [
            "Bonds Payable",
            "Accounts Receivable",
            "Prepaid Expenses",
            "Inventory"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows a company's revenues, expenses, and net income over a period of time?", 
        "o": [
            "Income Statement",
            "Balance Sheet",
            "Cash Flow Statement",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a non-current liability?", 
        "o": [
            "Long-term Loan",
            "Accounts Payable",
            "Accrued Expenses",
            "Unearned Revenue"
        ]
    },
    {
        "q": "What is the term for the process of recording expenses when they are incurred, regardless of when cash is paid?", 
        "o": [
            "Accrual Accounting",
            "Cash Accounting",
            "Depreciation",
            "Amortization"
        ]
    },
    {
        "q": "Which of the following is an example of an indirect expense?", 
        "o": [
            "Administrative Salaries",
            "Raw Materials",
            "Direct Labor",
            "Manufacturing Supplies"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows a company's assets, liabilities, and equity at a specific point in time?", 
        "o": [
            "Balance Sheet",
            "Income Statement",
            "Cash Flow Statement",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a non-monetary asset?", 
        "o": [
            "Goodwill",
            "Cash",
            "Accounts Receivable",
            "Short-term Investments"
        ]
    },
    {
        "q": "What is the term for the total amount of money a company has invested in its operations?", 
        "o": [
            "Capital",
            "Revenue",
            "Liabilities",
            "Expenses"
        ]
    },
    {
        "q": "Which of the following is an example of a deferred expense?", 
        "o": [
            "Prepaid Rent",
            "Accounts Payable",
            "Accrued Revenue",
            "Unearned Revenue"
        ]
    },
    {
        "q": "What is the term for the process of allocating the cost of a natural resource over its usage period?", 
        "o": [
            "Depletion",
            "Depreciation",
            "Amortization",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a financial asset?", 
        "o": [
            "Bonds Held for Investment",
            "Inventory",
            "Prepaid Insurance",
            "Accrued Revenue"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows a company's cash inflows and outflows over a period of time?", 
        "o": [
            "Cash Flow Statement",
            "Income Statement",
            "Balance Sheet",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a temporary account?", 
        "o": [
            "Rent Expense",
            "Building",
            "Land",
            "Loan Payable"
        ]
    },
    {
        "q": "What is the term for the process of recording revenue when cash is received and expenses when cash is paid?", 
        "o": [
            "Cash Accounting",
            "Accrual Accounting",
            "Depreciation",
            "Amortization"
        ]
    },
    {
        "q": "Which of the following is an example of a non-operating expense?", 
        "o": [
            "Interest Expense",
            "Salaries Expense",
            "Rent Expense",
            "Cost of Goods Sold"
        ]
    },
    {
        "q": "What is the term for the financial statement that summarizes a company's revenues, expenses, and net income over a period of time?", 
        "o": [
            "Income Statement",
            "Balance Sheet",
            "Cash Flow Statement",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a monetary asset?", 
        "o": [
            "Cash",
            "Goodwill",
            "Patent",
            "Land"
        ]
    },
    {
        "q": "What is the term for the total amount of money a company has available for day-to-day operations?", 
        "o": [
            "Working Capital",
            "Revenue",
            "Liabilities",
            "Expenses"
        ]
    },
    {
        "q": "Which of the following is an example of a deferred revenue?", 
        "o": [
            "Advance Payment for Services",
            "Accounts Receivable",
            "Prepaid Insurance",
            "Accrued Expenses"
        ]
    },
    {
        "q": "What is the term for the process of allocating the cost of an intangible asset over its useful life?", 
        "o": [
            "Amortization",
            "Depreciation",
            "Depletion",
            "Accrual"
        ]
    },
    {
        "q": "Which of the following is an example of a capital expenditure?", 
        "o": [
            "Purchase of Machinery",
            "Payment of Salaries",
            "Rent Expense",
            "Utilities Expense"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows changes in a company's cash position over a period of time?", 
        "o": [
            "Cash Flow Statement",
            "Income Statement",
            "Balance Sheet",
            "Statement of Equity"
        ]
    },
    {
        "q": "Which of the following is an example of a non-current asset?", 
        "o": [
            "Goodwill",
            "Cash",
            "Inventory",
            "Prepaid Rent"
        ]
    },
    {
        "q": "What is the term for the process of recording expenses in the period they are incurred, regardless of when cash is paid?", 
        "o": [
            "Accrual Accounting",
            "Cash Accounting",
            "Depreciation",
            "Amortization"
        ]
    },
    {
        "q": "Which of the following is an example of a direct cost?", 
        "o": [
            "Raw Materials",
            "Rent Expense",
            "Utilities Expense",
            "Salaries Expense"
        ]
    },
    {
        "q": "What is the term for the financial statement that shows a company's assets, liabilities, and equity at a specific point in time?", 
        "o": [
            "Balance Sheet",
            "Income Statement",
            "Cash Flow Statement",
            "Statement of Equity"
        ]
    }
]