[
  {
    "title": "Introduction to Tally ERP & Tally Prime",
    "ques": "What is Tally and how does it help businesses in accounting?",
    "answer": {
      "type": "text",
      "lang": null,
      "content": "Tally is an accounting software used by businesses to manage financial transactions, bookkeeping, and inventory management."
    },
    "explanation": "Tally is a widely used ***accounting software*** that helps businesses in various financial tasks.\n\n- ***Bookkeeping:*** It records financial transactions systematically.\n- ***GST & Taxation:*** Helps in tax compliance and GST return filing.\n- ***Inventory Management:*** Tracks stock levels and inventory movement.\n- ***Bank Reconciliation:*** Helps match accounting records with bank statements."
  },
  {
    "title": "Features & Advantages of Tally",
    "ques": "List some key features of Tally and explain their advantages.",
    "answer": {
      "type": "text",
      "lang": null,
      "content": "1. Accounting & Financial Management\n2. GST & Taxation Support\n3. Inventory & Stock Management\n4. Multi-Currency & Multi-User Support\n5. Payroll Management\n6. Data Security & Backup"
    },
    "explanation": "- ***Accounting & Financial Management:*** Maintains ledgers, profit/loss accounts, and balance sheets.\n- ***GST & Taxation Support:*** Helps businesses comply with tax regulations.\n- ***Inventory & Stock Management:*** Tracks stock levels, reduces wastage, and ensures proper stock control.\n- ***Multi-Currency & Multi-User Support:*** Enables businesses to work with different currencies and multiple users.\n- ***Payroll Management:*** Automates employee salary calculations, deductions, and payslip generation.\n- ***Data Security & Backup:*** Ensures secure storage and allows data recovery in case of loss."
  },
  {
    "title": "Setting Up Company in Tally",
    "ques": "How do you create a new company in Tally?",
    "answer": {
      "type": "text",
      "lang": null,
      "content": "1. Open Tally and go to 'Company Info'\n2. Select 'Create Company'\n3. Enter Company Name, Address, and Financial Year details\n4. Set the base currency\n5. Save the company"
    },
    "explanation": "To create a company in Tally, follow these steps:\n\n1. ***Open Tally:*** Launch the software and navigate to the 'Company Info' menu.\n2. ***Create Company:*** Select 'Create Company' from the options.\n3. ***Enter Details:*** Provide the ***Company Name***, ***Address***, ***Financial Year***, and other required information.\n4. ***Set Base Currency:*** Choose the default currency for transactions.\n5. ***Save and Use:*** Press `Ctrl + A` to save and start using the company profile."
  },
  {
    "title": "Navigation & Shortcuts",
    "ques": "What are some commonly used shortcuts in Tally?",
    "answer": {
      "type": "text",
      "lang": null,
      "content": "1. Alt + F3 - Company Info\n2. F11 - Features Configuration\n3. Ctrl + A - Save\n4. F2 - Change Date\n5. F12 - Configuration\n6. Ctrl + N - Calculator"
    },
    "explanation": "Tally provides various keyboard shortcuts to enhance efficiency:\n\n- ***Alt + F3:*** Opens the Company Information menu to create, select, or alter a company.\n- ***F11:*** Opens 'Features Configuration' to enable/disable accounting, inventory, and taxation features.\n- ***Ctrl + A:*** Instantly saves the current screen or entry.\n- ***F2:*** Allows the user to change the voucher entry date.\n- ***F12:*** Opens the configuration menu for customization.\n- ***Ctrl + N:*** Opens the calculator inside Tally for quick calculations."
  },
  {
    "title": "Introduction to Tally ERP & Tally Prime",
    "ques": "What is the difference between Tally ERP 9 and Tally Prime?",
    "answer": {
      "type": "text",
      "lang": null,
      "content": "Tally ERP 9 is the older version, while Tally Prime is the latest version with an improved user interface, simplified navigation, and enhanced features."
    },
    "explanation": "Tally Prime is the upgraded version of Tally ERP 9 with the following key differences:\n\n- ***User Interface:*** Tally Prime has a more modern and intuitive UI compared to Tally ERP 9.\n- ***Navigation:*** Tally Prime allows multitasking and easier switching between reports without closing windows.\n- ***Search Feature:*** A global search bar in Tally Prime helps users quickly find features, reports, or vouchers.\n- ***Go To Feature:*** Allows users to navigate between ledgers and reports without exiting the current screen.\n- ***GST Reports:*** More simplified GST reports with improved customization options."
  },
  {
    "title": "Features & Advantages of Tally",
    "ques": "How does Tally help in bank reconciliation?",
    "answer": {
      "type": "text",
      "lang": null,
      "content": "Tally allows users to import bank statements and match transactions with ledger entries automatically, reducing manual errors."
    },
    "explanation": "Bank reconciliation in Tally helps businesses ensure accuracy in their financial records:\n\n- ***Import Bank Statements:*** Users can import bank statements in `Excel`, `CSV`, or `MT940` format.\n- ***Auto-Matching:*** Tally automatically matches transactions between bank statements and ledger entries.\n- ***Pending Transactions:*** Identifies unrecorded transactions that need to be updated in Tally.\n- ***Discrepancy Detection:*** Helps businesses detect errors like duplicate payments or missed entries.\n- ***Reconciliation Report:*** Generates a detailed report for easy verification and auditing."
  },
  {
    "title": "Setting Up Company in Tally",
    "ques": "What are the different accounting periods in Tally, and how do they affect financial reporting?",
    "answer": {
      "type": "text",
      "lang": null,
      "content": "Tally allows users to define financial years based on business requirements, typically from April to March in India, but it can be customized as per company needs."
    },
    "explanation": "Tally allows businesses to define their accounting periods, affecting financial reporting:\n\n- ***Default Accounting Period:*** In India, the standard accounting period is from `April 1 to March 31`.\n- ***Custom Period:*** Businesses can modify the financial year based on regulatory or operational requirements.\n- ***Multiple Period Comparison:*** Tally enables users to compare reports across different financial years.\n- ***Year-End Adjustments:*** Helps businesses finalize accounts before starting a new financial year.\n- ***Changing Financial Year:*** The financial year can be updated via `Company Info > Alter Company`."
  },
  {
    "title": "Navigation & Shortcuts",
    "ques": "What is the 'Go To' feature in Tally Prime, and how does it improve efficiency?",
    "answer": {
      "type": "text",
      "lang": null,
      "content": "The 'Go To' feature in Tally Prime allows users to quickly navigate between different reports, vouchers, and ledgers without closing the current screen."
    },
    "explanation": "The 'Go To' feature in Tally Prime enhances productivity by:\n\n- ***Quick Access:*** Users can type keywords to directly open reports, ledgers, or vouchers.\n- ***Multitasking:*** Allows users to open different sections without losing progress in the current task.\n- ***Time-Saving:*** Reduces the need for multiple menu clicks.\n- ***Universal Search:*** Helps locate any feature or data instantly.\n- ***Shortcut:*** Activated by pressing `Alt + G` in Tally Prime."
  }
]